{
	"schema_version": "1.6.0",
	"id": "DSA-2314-1",
	"modified": "2023-10-16T00:11:07.717804Z",
	"published": "2011-10-03T00:00:00Z",
	"related": [
		"CVE-2011-3848",
		"CVE-2011-3869",
		"CVE-2011-3870",
		"CVE-2011-3871"
	],
	"summary": "puppet - several",
	"details": "\nMultiple security issues have been discovered in Puppet, a centralized\nconfiguration management system. The Common Vulnerabilities and Exposures\nproject identifies the following problems:\n\n\n* [CVE-2011-3848](https://security-tracker.debian.org/tracker/CVE-2011-3848)\nKristian Erik Hermansen reported that an unauthenticated\n directory traversal could drop any valid X.509 Certificate Signing\n Request at any location on disk, with the privileges of the Puppet\n Master application.\n* [CVE-2011-3870](https://security-tracker.debian.org/tracker/CVE-2011-3870)\nRicky Zhou discovered a potential local privilege escalation in the\n ssh\\_authorized\\_keys resource and theoretically in the Solaris and\n AIX providers, where file ownership was given away before it was\n written, leading to a possibility for a user to overwrite arbitrary\n files as root, if their authorized\\_keys file was managed.\n* [CVE-2011-3869](https://security-tracker.debian.org/tracker/CVE-2011-3869)\nA predictable file name in the k5login type leads to the possibility\n of symlink attacks which would allow the owner of the home directory\n to symlink to anything on the system, and have it replaced with the\n correct content of the file, which can lead to a privilege escalation\n on puppet runs.\n* [CVE-2011-3871](https://security-tracker.debian.org/tracker/CVE-2011-3871)\nA potential local privilege escalation was found in the --edit mode\n of puppet resource due to a persistent, predictable file name,\n which can result in editing an arbitrary target file, and thus be\n be tricked into running that arbitrary file as the invoking\n user. This command is most commonly run as root, this leads to a\n potential privilege escalation.\n\n\nAdditionally, this update hardens the indirector file backed terminus base\nclass against injection attacks based on trusted path names.\n\n\nFor the oldstable distribution (lenny), this problem will be fixed soon.\n\n\nFor the stable distribution (squeeze), this problem has been fixed in\nversion 2.6.2-5+squeeze1.\n\n\nFor the testing distribution (wheezy), this problem has been fixed in\nversion 2.7.3-3.\n\n\nFor the unstable distribution (sid), this problem has been fixed in\nversion 2.7.3-3.\n\n\nWe recommend that you upgrade your puppet packages.\n\n\n",
	"affected": [
		{
			"package": {
				"ecosystem": "Debian:6.0",
				"name": "puppet",
				"purl": "pkg:deb/debian/puppet?arch=source"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "2.6.2-5+squeeze1"
						}
					]
				}
			],
			"versions": [
				"2.6.2-4",
				"2.6.2-5"
			],
			"database_specific": {
				"source": "https://storage.googleapis.com/debian-osv/dsa-osv/DSA-2314-1.json"
			}
		}
	],
	"references": [
		{
			"type": "ADVISORY",
			"url": "https://www.debian.org/security/2011/dsa-2314"
		}
	]
}
