{
	"schema_version": "1.6.0",
	"id": "DLA-3398-1",
	"modified": "2023-06-28T06:42:58.054116Z",
	"published": "2023-04-21T00:00:00Z",
	"related": [
		"CVE-2023-27533",
		"CVE-2023-27535",
		"CVE-2023-27536",
		"CVE-2023-27538"
	],
	"summary": "curl - security update",
	"details": "\nSeveral security vulnerabilities have been found in cURL, an easy-to-use\nclient-side URL transfer library.\n\n\n* [CVE-2023-27533](https://security-tracker.debian.org/tracker/CVE-2023-27533)\nA vulnerability in input validation exists in curl during\n communication using the TELNET protocol may allow an attacker to pass on\n maliciously crafted user name and telnet options during server\n negotiation. The lack of proper input scrubbing allows an attacker to send\n content or perform option negotiation without the application's intent.\n This vulnerability could be exploited if an application allows user input,\n thereby enabling attackers to execute arbitrary code on the system.\n* [CVE-2023-27535](https://security-tracker.debian.org/tracker/CVE-2023-27535)\nAn authentication bypass vulnerability exists in libcurl in the FTP\n connection reuse feature that can result in wrong credentials being used\n during subsequent transfers. Previously created connections are kept in a\n connection pool for reuse if they match the current setup. However, certain\n FTP settings such as CURLOPT\\_FTP\\_ACCOUNT, CURLOPT\\_FTP\\_ALTERNATIVE\\_TO\\_USER,\n CURLOPT\\_FTP\\_SSL\\_CCC, and CURLOPT\\_USE\\_SSL were not included in the\n configuration match checks, causing them to match too easily. This could\n lead to libcurl using the wrong credentials when performing a transfer,\n potentially allowing unauthorized access to sensitive information.\n* [CVE-2023-27536](https://security-tracker.debian.org/tracker/CVE-2023-27536)\nAn authentication bypass vulnerability exists in libcurl in the\n connection reuse feature which can reuse previously established connections\n with incorrect user permissions due to a failure to check for changes in\n the CURLOPT\\_GSSAPI\\_DELEGATION option. This vulnerability affects\n krb5/kerberos/negotiate/GSSAPI transfers and could potentially result in\n unauthorized access to sensitive information. The safest option is to not\n reuse connections if the CURLOPT\\_GSSAPI\\_DELEGATION option has been changed.\n* [CVE-2023-27538](https://security-tracker.debian.org/tracker/CVE-2023-27538)\nAn authentication bypass vulnerability exists in libcurl where it\n reuses a previously established SSH connection despite the fact that an SSH\n option was modified, which should have prevented reuse. libcurl maintains a\n pool of previously used connections to reuse them for subsequent transfers\n if the configurations match. However, two SSH settings were omitted from\n the configuration check, allowing them to match easily, potentially leading\n to the reuse of an inappropriate connection.\n\n\nFor Debian 10 buster, these problems have been fixed in version\n7.64.0-4+deb10u6.\n\n\nWe recommend that you upgrade your curl packages.\n\n\nFor the detailed security status of curl please refer to\nits security tracker page at:\n<https://security-tracker.debian.org/tracker/curl>\n\n\nFurther information about Debian LTS security advisories, how to apply\nthese updates to your system and frequently asked questions can be\nfound at: <https://wiki.debian.org/LTS>\n\n\n",
	"affected": [
		{
			"package": {
				"ecosystem": "Debian:10",
				"name": "curl",
				"purl": "pkg:deb/debian/curl?arch=source"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "7.64.0-4+deb10u6"
						}
					]
				}
			],
			"versions": [
				"7.64.0-4",
				"7.64.0-4+deb10u1",
				"7.64.0-4+deb10u2",
				"7.64.0-4+deb10u3",
				"7.64.0-4+deb10u4",
				"7.64.0-4+deb10u5"
			],
			"database_specific": {
				"source": "https://storage.googleapis.com/debian-osv/dla-osv/DLA-3398-1.json"
			}
		}
	],
	"references": [
		{
			"type": "ADVISORY",
			"url": "https://www.debian.org/lts/security/2023/dla-3398"
		}
	]
}
