{
	"schema_version": "1.6.0",
	"id": "DLA-772-1",
	"modified": "2023-06-28T06:43:13.206018Z",
	"published": "2017-01-01T00:00:00Z",
	"related": [
		"CVE-2012-6704",
		"CVE-2015-1350",
		"CVE-2015-8962",
		"CVE-2015-8963",
		"CVE-2015-8964",
		"CVE-2016-10088",
		"CVE-2016-7097",
		"CVE-2016-7910",
		"CVE-2016-7911",
		"CVE-2016-7915",
		"CVE-2016-8399",
		"CVE-2016-8633",
		"CVE-2016-8645",
		"CVE-2016-8655",
		"CVE-2016-9178",
		"CVE-2016-9555",
		"CVE-2016-9576",
		"CVE-2016-9756",
		"CVE-2016-9793",
		"CVE-2016-9794"
	],
	"summary": "linux - security update",
	"details": "\nSeveral vulnerabilities have been discovered in the Linux kernel that\nmay lead to a privilege escalation, denial of service or information\nleaks.\n\n\n* [CVE-2012-6704](https://security-tracker.debian.org/tracker/CVE-2012-6704) /\n [CVE-2016-9793](https://security-tracker.debian.org/tracker/CVE-2016-9793)\nEric Dumazet found that a local user with CAP\\_NET\\_ADMIN capability\n could set a socket's buffer size to be negative, leading to a\n denial of service or other security impact. Additionally, in\n kernel versions prior to 3.5, any user could do this if sysctl\n net.core.rmem\\_max was changed to a very large value.\n* [CVE-2015-1350](https://security-tracker.debian.org/tracker/CVE-2015-1350) / #770492\n\n Ben Harris reported that local users could remove set-capability\n attributes from any file visible to them, allowing a denial of\n service.\n* [CVE-2015-8962](https://security-tracker.debian.org/tracker/CVE-2015-8962)\nCalvin Owens fouund that removing a SCSI device while it was being\n accessed through the SCSI generic (sg) driver led to a double \n free, possibly causing a denial of service (crash or memory\n corruption) or privilege escalation. This could be exploited by\n local users with permision to access a SCSI device node.\n* [CVE-2015-8963](https://security-tracker.debian.org/tracker/CVE-2015-8963)\nSasha Levin reported that hot-unplugging a CPU resulted in a\n use-after-free by the performance events (perf) subsystem,\n possibly causing a denial of service (crash or memory corruption)\n or privilege escalation. This could by exploited by any local\n user.\n* [CVE-2015-8964](https://security-tracker.debian.org/tracker/CVE-2015-8964)\nIt was found that the terminal/serial (tty) subsystem did not\n reliably reset the terminal buffer state when the terminal line\n discipline was changed. This could allow a local user with access\n to a terminal device to read sensitive information from kernel\n memory.\n* [CVE-2016-7097](https://security-tracker.debian.org/tracker/CVE-2016-7097)\nJan Kara found that changing the POSIX ACL of a file never cleared\n its set-group-ID flag, which should be done if the user changing\n it is not a member of the group-owner. In some cases, this would\n allow the user-owner of an executable to gain the privileges of\n the group-owner.\n* [CVE-2016-7910](https://security-tracker.debian.org/tracker/CVE-2016-7910)\nVegard Nossum discovered that a memory allocation failure while\n handling a read of /proc/diskstats or /proc/partitions could lead\n to a use-after-free, possibly causing a denial of service (crash\n or memory corruption) or privilege escalation.\n* [CVE-2016-7911](https://security-tracker.debian.org/tracker/CVE-2016-7911)\nDmitry Vyukov reported that a race between ioprio\\_get() and\n ioprio\\_set() system calls could result in a use-after-free,\n possibly causing a denial of service (crash) or leaking sensitive\n information.\n* [CVE-2016-7915](https://security-tracker.debian.org/tracker/CVE-2016-7915)\nBenjamin Tissoires found that HID devices could trigger an out-of \n bounds memory access in the HID core. A physically present user\n could possibly use this for denial of service (crash) or to leak\n sensitive information.\n* [CVE-2016-8399](https://security-tracker.debian.org/tracker/CVE-2016-8399)\nQidan He reported that the IPv4 ping socket implementation did\n not validate the length of packets to be sent. A user with\n permisson to use ping sockets could cause an out-of-bounds read,\n possibly resulting in a denial of service or information leak.\n However, on Debian systems no users have permission to create ping\n sockets by default.\n* [CVE-2016-8633](https://security-tracker.debian.org/tracker/CVE-2016-8633)\nEyal Itkin reported that the IP-over-Firewire driver\n (firewire-net) did not validate the offset or length in link-layer\n fragmentation headers. This allowed a remote system connected by\n Firewire to write to memory after a packet buffer, leading to a\n denial of service (crash) or remote code execution.\n* [CVE-2016-8645](https://security-tracker.debian.org/tracker/CVE-2016-8645)\nMarco Grassi reported that if a socket filter (BPF program)\n attached to a TCP socket truncates or removes the TCP header, this\n could cause a denial of service (crash). This was exploitable by\n any local user.\n* [CVE-2016-8655](https://security-tracker.debian.org/tracker/CVE-2016-8655)\nPhilip Pettersson found that the implementation of packet sockets\n (AF\\_PACKET family) had a race condition between enabling a\n transmit ring buffer and changing the version of buffers used,\n which could result in a use-after-free. A local user with the\n CAP\\_NET\\_ADMIN capability could exploit this for privilege\n escalation.\n* [CVE-2016-9178](https://security-tracker.debian.org/tracker/CVE-2016-9178)\nAl Viro found that a failure to read data from user memory might\n lead to a information leak on the x86 architecture (amd64 or i386).\n* [CVE-2016-9555](https://security-tracker.debian.org/tracker/CVE-2016-9555)\nAndrey Konovalov reported that the SCTP implementation does not\n validate out of the blue packet chunk lengths early enough. A\n remote system able could use this to cause a denial of service\n (crash) or other security impact for systems using SCTP.\n* [CVE-2016-9576](https://security-tracker.debian.org/tracker/CVE-2016-9576) /\n [CVE-2016-10088](https://security-tracker.debian.org/tracker/CVE-2016-10088)\nDmitry Vyukov reported that using splice() with the SCSI generic\n driver led to kernel memory corruption. Local users with\n permision to access a SCSI device node could exploit this for\n privilege escalation.\n* [CVE-2016-9756](https://security-tracker.debian.org/tracker/CVE-2016-9756)\nDmitry Vyukov reported that KVM for the x86 architecture (amd64 or\n i386) did not correctly handle the failure of certain instructions\n that require software emulation on older processors. This could\n be exploited by guest systems to leak sensitive information or for\n denial of service (log spam).\n* [CVE-2016-9794](https://security-tracker.debian.org/tracker/CVE-2016-9794)\nBaozeng Ding reported a race condition in the ALSA (sound)\n subsystem that could result in a use-after-free. Local users with\n access to a PCM sound device could exploit this for denial of\n service (crash or memory corruption) or other security impact.\n\n\nFor Debian 7 Wheezy, these problems have been fixed in version\n3.2.84-1. This version also includes bug fixes from upstream version\n3.2.84 and updates the PREEMPT\\_RT featureset to version 3.2.84-rt122.\nFinally, this version adds the option to mitigate security issues in\nthe performance events (perf) subsystem by disabling use by\nunprivileged users. This can be done by setting sysctl\nkernel.perf\\_event\\_paranoid=3.\n\n\nFor Debian 8 Jessie, these problems have been fixed in version\n3.16.39-1 which will be included in the next point release (8.6).\n\n\nWe recommend that you upgrade your linux packages.\n\n\nFurther information about Debian LTS security advisories, how to apply\nthese updates to your system and frequently asked questions can be\nfound at: <https://wiki.debian.org/LTS>\n\n\n",
	"affected": [
		{
			"package": {
				"ecosystem": "Debian:7",
				"name": "linux",
				"purl": "pkg:deb/debian/linux?arch=source"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "3.2.84-1"
						}
					]
				}
			],
			"versions": [
				"3.2.41-2",
				"3.2.41-2+deb7u1",
				"3.2.41-2+deb7u2",
				"3.2.41-2+deb7u2~bpo60+1",
				"3.2.46-1",
				"3.2.46-1+deb7u1",
				"3.2.46-1+deb7u1~bpo60+1",
				"3.2.46-1~bpo60+1",
				"3.2.51-1",
				"3.2.51-1~bpo60+1",
				"3.2.53-1",
				"3.2.53-2",
				"3.2.54-1",
				"3.2.54-2",
				"3.2.54-2~bpo60+1",
				"3.2.57-1",
				"3.2.57-2",
				"3.2.57-3",
				"3.2.57-3+deb7u1",
				"3.2.57-3+deb7u2",
				"3.2.57-3+deb7u2~bpo60+1",
				"3.2.60-1",
				"3.2.60-1+deb7u1",
				"3.2.60-1+deb7u2",
				"3.2.60-1+deb7u3",
				"3.2.60-1+deb7u3~bpo60+1",
				"3.2.63-1",
				"3.2.63-2",
				"3.2.63-2+deb7u1",
				"3.2.63-2+deb7u1~bpo60+1",
				"3.2.63-2+deb7u2",
				"3.2.63-2+deb7u2~bpo60+1",
				"3.2.65-1",
				"3.2.65-1+deb7u1",
				"3.2.65-1+deb7u1~bpo60+1",
				"3.2.65-1+deb7u2",
				"3.2.65-1+deb7u2~bpo60+1",
				"3.2.68-1",
				"3.2.68-1+deb7u1",
				"3.2.68-1+deb7u1~bpo60+1",
				"3.2.68-1+deb7u2",
				"3.2.68-1+deb7u2~bpo60+1",
				"3.2.68-1+deb7u3",
				"3.2.68-1+deb7u3~bpo60+1",
				"3.2.68-1+deb7u4",
				"3.2.68-1+deb7u4~bpo60+1",
				"3.2.68-1+deb7u5",
				"3.2.68-1+deb7u6",
				"3.2.68-1+deb7u6~bpo60+1",
				"3.2.71-1",
				"3.2.71-2",
				"3.2.73-1",
				"3.2.73-2",
				"3.2.73-2+deb7u1",
				"3.2.73-2+deb7u2",
				"3.2.73-2+deb7u2~bpo60+1",
				"3.2.73-2+deb7u3",
				"3.2.78-1",
				"3.2.81-1",
				"3.2.81-2",
				"3.2.82-1"
			],
			"database_specific": {
				"source": "https://storage.googleapis.com/debian-osv/dla-osv/DLA-772-1.json"
			}
		}
	],
	"references": [
		{
			"type": "ADVISORY",
			"url": "https://www.debian.org/lts/security/2017/dla-772"
		}
	]
}
