{
	"schema_version": "1.6.0",
	"id": "DSA-1363-1",
	"modified": "2023-10-16T00:10:21.970474Z",
	"published": "2007-08-31T00:00:00Z",
	"related": [
		"CVE-2007-2172",
		"CVE-2007-2875",
		"CVE-2007-3105",
		"CVE-2007-3843",
		"CVE-2007-4308"
	],
	"summary": "linux-2.6",
	"details": "\nSeveral local and remote vulnerabilities have been discovered in the Linux\nkernel that may lead to a denial of service or the execution of arbitrary\ncode. The Common Vulnerabilities and Exposures project identifies the\nfollowing problems:\n\n\n* [CVE-2007-2172](https://security-tracker.debian.org/tracker/CVE-2007-2172)\nThomas Graf reported a typo in the IPv4 protocol handler that could\n be used by a local attacker to overrun an array via crafted packets,\n potentially resulting in a Denial of Service (system crash).\n The DECnet counterpart of this issue was already fixed in DSA-1356.\n* [CVE-2007-2875](https://security-tracker.debian.org/tracker/CVE-2007-2875)\niDefense reported a potential integer underflow in the cpuset filesystem\n which may permit local attackers to gain access to sensitive kernel\n memory. This vulnerability is only exploitable if the cpuset filesystem\n is mounted.\n* [CVE-2007-3105](https://security-tracker.debian.org/tracker/CVE-2007-3105)\nThe PaX Team discovered a potential buffer overflow in the random number\n generator which may permit local users to cause a denial of service or\n gain additional privileges. This issue is not believed to effect default\n Debian installations where only root has sufficient privileges to exploit\n it.\n* [CVE-2007-3843](https://security-tracker.debian.org/tracker/CVE-2007-3843)\nA coding error in the CIFS subsystem permits the use of unsigned messages\n even if the client has configured the system to enforce\n signing by passing the sec=ntlmv2i mount option. This may allow remote\n attackers to spoof CIFS network traffic.\n* [CVE-2007-4308](https://security-tracker.debian.org/tracker/CVE-2007-4308)\nAlan Cox reported an issue in the aacraid driver that allows unprivileged\n local users to make ioctl calls which should be restricted to admin\n privileges.\n\n\nThese problems have been fixed in the stable distribution in version \n2.6.18.dfsg.1-13etch2.\n\n\nThe following matrix lists additional packages that were rebuilt for\ncompatibility with or to take advantage of this update:\n\n\n\n\n|  | Debian 4.0 (etch) |\n| --- | --- |\n| fai-kernels | 1.17+etch5 |\n| user-mode-linux | 2.6.18-1um-2etch4 |\n\n\nWe recommend that you upgrade your kernel package immediately and reboot\nthe machine. If you have built a custom kernel from the kernel source\npackage, you will need to rebuild to take advantage of these fixes.\n\n\n",
	"affected": [
		{
			"package": {
				"ecosystem": "Debian:4.0",
				"name": "linux-2.6",
				"purl": "pkg:deb/debian/linux-2.6?arch=source"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "2.6.18.dfsg.1-13etch2"
						}
					]
				}
			],
			"versions": [
				"2.6.18.dfsg.1-12",
				"2.6.18.dfsg.1-12etch1",
				"2.6.18.dfsg.1-12etch2",
				"2.6.18.dfsg.1-13",
				"2.6.18.dfsg.1-13etch1"
			],
			"database_specific": {
				"source": "https://storage.googleapis.com/debian-osv/dsa-osv/DSA-1363-1.json"
			}
		}
	],
	"references": [
		{
			"type": "ADVISORY",
			"url": "https://www.debian.org/security/2007/dsa-1363"
		}
	]
}
