{
	"schema_version": "1.6.0",
	"id": "DLA-2689-1",
	"modified": "2023-06-28T06:36:54.065404Z",
	"published": "2021-06-22T00:00:00Z",
	"related": [
		"CVE-2020-24586",
		"CVE-2020-24587",
		"CVE-2020-24588",
		"CVE-2020-25670",
		"CVE-2020-25671",
		"CVE-2020-25672",
		"CVE-2020-26139",
		"CVE-2020-26147",
		"CVE-2020-26558",
		"CVE-2020-29374",
		"CVE-2020-36322",
		"CVE-2021-0129",
		"CVE-2021-0512",
		"CVE-2021-20292",
		"CVE-2021-23133",
		"CVE-2021-23134",
		"CVE-2021-28660",
		"CVE-2021-28688",
		"CVE-2021-28950",
		"CVE-2021-28964",
		"CVE-2021-28971",
		"CVE-2021-29154",
		"CVE-2021-29265",
		"CVE-2021-29647",
		"CVE-2021-29650",
		"CVE-2021-30002",
		"CVE-2021-31916",
		"CVE-2021-32399",
		"CVE-2021-33034",
		"CVE-2021-3428",
		"CVE-2021-3483",
		"CVE-2021-3564",
		"CVE-2021-3573",
		"CVE-2021-38208"
	],
	"summary": "linux - security update",
	"details": "\nSeveral vulnerabilities have been discovered in the Linux kernel that\nmay lead to the execution of arbitrary code, privilege escalation,\ndenial of service, or information leaks.\n\n\nThis update is not yet available for the armel (ARM EABI soft-float)\narchitecture.\n\n\n* [CVE-2020-24586](https://security-tracker.debian.org/tracker/CVE-2020-24586), [CVE-2020-24587](https://security-tracker.debian.org/tracker/CVE-2020-24587), [CVE-2020-26147](https://security-tracker.debian.org/tracker/CVE-2020-26147)\nMathy Vanhoef discovered that many Wi-Fi implementations,\n including Linux's mac80211, did not correctly implement reassembly\n of fragmented packets. In some circumstances, an attacker within\n range of a network could exploit these flaws to forge arbitrary\n packets and/or to access sensitive data on that network.\n* [CVE-2020-24588](https://security-tracker.debian.org/tracker/CVE-2020-24588)\nMathy Vanhoef discovered that most Wi-Fi implementations,\n including Linux's mac80211, did not authenticate the is\n aggregated packet header flag. An attacker within range of a\n network could exploit this to forge arbitrary packets on that\n network.\n* [CVE-2020-25670](https://security-tracker.debian.org/tracker/CVE-2020-25670), [CVE-2020-25671](https://security-tracker.debian.org/tracker/CVE-2020-25671), [CVE-2021-23134](https://security-tracker.debian.org/tracker/CVE-2021-23134)\nkiyin (ĺ°šäşŽ) of TenCent discovered several reference counting bugs\n in the NFC LLCP implementation which could lead to use-after-free.\n A local user could exploit these for denial of service (crash or\n memory corruption) or possibly for privilege escalation.\n\n\nNadav Markus and Or Cohen of Palo Alto Networks discovered that\n the original fixes for these introduced a new bug that could\n result in use-after-free and double-free. This has also been\n fixed.\n* [CVE-2020-25672](https://security-tracker.debian.org/tracker/CVE-2020-25672)\nkiyin (ĺ°šäşŽ) of TenCent discovered a memory leak in the NFC LLCP\n implementation. A local user could exploit this for denial of\n service (memory exhaustion).\n* [CVE-2020-26139](https://security-tracker.debian.org/tracker/CVE-2020-26139)\nMathy Vanhoef discovered that a bug in some Wi-Fi implementations,\n including Linux's mac80211. When operating in AP mode, they would\n forward EAPOL frames from one client to another while the sender\n was not yet authenticated. An attacker within range of a network\n could use this for denial of service or as an aid to exploiting\n other vulnerabilities.\n* [CVE-2020-26558](https://security-tracker.debian.org/tracker/CVE-2020-26558), [CVE-2021-0129](https://security-tracker.debian.org/tracker/CVE-2021-0129)\nResearchers at ANSSI discovered vulnerabilities in the Bluetooth\n Passkey authentication method, and in Linux's implementation of\n it. An attacker within range of two Bluetooth devices while they\n pair using Passkey authentication could exploit this to obtain the\n shared secret (Passkey) and then impersonate either of the devices\n to each other.\n* [CVE-2020-29374](https://security-tracker.debian.org/tracker/CVE-2020-29374)\nJann Horn of Google reported a flaw in Linux's virtual memory\n management. A parent and child process initially share all their\n memory, but when either writes to a shared page, the page is\n duplicated and unshared (copy-on-write). However, in case an\n operation such as vmsplice() required the kernel to take an\n additional reference to a shared page, and a copy-on-write occurs\n during this operation, the kernel might have accessed the wrong\n process's memory. For some programs, this could lead to an\n information leak or data corruption.\n* [CVE-2020-36322](https://security-tracker.debian.org/tracker/CVE-2020-36322), [CVE-2021-28950](https://security-tracker.debian.org/tracker/CVE-2021-28950)\nThe syzbot tool found that the FUSE (filesystem-in-user-space)\n implementation did not correctly handle a FUSE server returning\n invalid attributes for a file. A local user permitted to run a\n FUSE server could use this to cause a denial of service (crash).\n\n\nThe original fix for this introduced a different potential denial\n of service (infinite loop in kernel space), which has also been\n fixed.\n* [CVE-2021-3428](https://security-tracker.debian.org/tracker/CVE-2021-3428)\nWolfgang Frisch reported a potential integer overflow in the ext4\n filesystem driver. A user permitted to mount arbitrary filesystem\n images could use this to cause a denial of service (crash).\n* [CVE-2021-3483](https://security-tracker.debian.org/tracker/CVE-2021-3483)\néŠŹĺ˛ĺŽ (Zheyu Ma) reported a bug in the nosy driver for TI\n PCILynx FireWire controllers, which could lead to list corruption\n and a use-after-free. On a system that uses this driver, local\n users granted access to /dev/nosy could exploit this to cause a\n denial of service (crash or memory corruption) or possibly for\n privilege escalation.\n* [CVE-2021-3564](https://security-tracker.debian.org/tracker/CVE-2021-3564), [CVE-2021-3573](https://security-tracker.debian.org/tracker/CVE-2021-3573), [CVE-2021-32399](https://security-tracker.debian.org/tracker/CVE-2021-32399)\nThe BlockSec team discovered several race conditions in the\n Bluetooth subsystem that could lead to a use-after-free or\n double-free. A local user could exploit these to caue a denial of\n service (crash or memory corruption) or possibly for privilege\n escalation.\n* [CVE-2021-3587](https://security-tracker.debian.org/tracker/CVE-2021-3587)\nActive Defense Lab of Venustech discovered a potential null\n pointer dereference in the NFC LLCP implementation. A local user\n could use this to cause a denial of service (crash).\n* [CVE-2021-20292](https://security-tracker.debian.org/tracker/CVE-2021-20292)\nIt was discovered that the TTM buffer allocation API used by GPU\n drivers did not handle allocation failures in the way that most\n drivers expected, resulting in a double-free on failure. A local\n user on a system using one of these drivers could possibly exploit\n this to cause a denial of service (crash or memory corruption) or\n for privilege escalation. The API has been changed to match\n driver expectations.\n* [CVE-2021-23133](https://security-tracker.debian.org/tracker/CVE-2021-23133)\nOr Cohen of Palo Alto Networks discovered a race condition in the\n SCTP implementation, which can lead to list corruption. A local\n user could exploit this to cause a denial of service (crash or\n memory corruption) or possibly for privilege escalation.\n* [CVE-2021-28660](https://security-tracker.debian.org/tracker/CVE-2021-28660)\nIt was discovered that the rtl8188eu WiFi driver did not correctly\n limit the length of SSIDs copied into scan results. An attacker\n within WiFi range could use this to cause a denial of service\n (crash or memory corruption) or possibly to execute code on a\n vulnerable system.\n* [CVE-2021-28688](https://security-tracker.debian.org/tracker/CVE-2021-28688) ([XSA-371](https://xenbits.xen.org/xsa/advisory-371.html))\n\n It was discovered that the original fix for [CVE-2021-26930](https://security-tracker.debian.org/tracker/CVE-2021-26930)\n ([XSA-365](https://xenbits.xen.org/xsa/advisory-365.html)) introduced a potential resource leak. A malicious guest\n could presumably exploit this to cause a denial of service\n (resource exhaustion) within the host.\n* [CVE-2021-28964](https://security-tracker.debian.org/tracker/CVE-2021-28964)\nZygo Blaxell reported a race condition in the Btrfs driver which\n can lead to an assertion failure. On systems using Btrfs, a local\n user could exploit this to cause a denial of service (crash).\n* [CVE-2021-28971](https://security-tracker.debian.org/tracker/CVE-2021-28971)\nVince Weaver reported a bug in the performance event handler for\n Intel PEBS. A workaround for a hardware bug on Intel CPUs\n codenamed Haswell and earlier could lead to a null pointer\n dereference. On systems with the affected CPUs, if users are\n permitted to access performance events, a local user may exploit\n this to cause a denial of service (crash).\n\n\nBy default, unprivileged users do not have access to performance\n events, which mitigates this issue. This is controlled by the\n kernel.perf\\_event\\_paranoid sysctl.\n* [CVE-2021-29154](https://security-tracker.debian.org/tracker/CVE-2021-29154)\nIt was discovered that the Extended BPF (eBPF) JIT compiler\n for x86\\_64 generated incorrect branch instructions in some\n cases. On systems where eBPF JIT is enabled, users could\n exploit this to execute arbitrary code in the kernel.\n\n\nBy default, eBPF JIT is disabled, mitigating this issue. This is\n controlled by the net.core.bpf\\_jit\\_enable sysctl.\n* [CVE-2021-29265](https://security-tracker.debian.org/tracker/CVE-2021-29265)\nThe syzbot tool found a race condition in the USB/IP host\n (server) implementation which can lead to a null pointer\n dereference. On a system acting as a USB/IP host, a client\n can exploit this to cause a denial of service (crash).\n* [CVE-2021-29647](https://security-tracker.debian.org/tracker/CVE-2021-29647)\nThe syzbot tool found an information leak in the Qualcomm IPC\n Router (qrtr) implementation.\n\n\nThis protocol is not enabled in Debian's official kernel\n configurations.\n* [CVE-2021-29650](https://security-tracker.debian.org/tracker/CVE-2021-29650)\nIt was discovered that a data race in the netfilter subsystem\n could lead to a null pointer dereference during replacement of a\n table. A local user with CAP\\_NET\\_ADMIN capability in any user\n namespace could use this to cause a denial of service (crash).\n\n\nBy default, unprivileged users cannot create user namespaces,\n which mitigates this issue. This is controlled by the\n kernel.unprivileged\\_userns\\_clone sysctl.\n* [CVE-2021-30002](https://security-tracker.debian.org/tracker/CVE-2021-30002)\nArnd Bergmann and the syzbot tool found a memory leak in the\n Video4Linux (v4l) subsystem. A local user permitted to access\n video devices (by default, any member of the video group) could\n exploit this to cause a denial of service (memory exhaustion).\n* [CVE-2021-31916](https://security-tracker.debian.org/tracker/CVE-2021-31916)\nDan Carpenter reported incorrect parameter validation in the\n device-mapper (dm) subsystem, which could lead to a heap buffer\n overrun. However, only users with CAP\\_SYS\\_ADMIN capability\n (i.e. root-equivalent) could trigger this bug, so it did not\n have any security impact in this kernel version.\n* [CVE-2021-33034](https://security-tracker.debian.org/tracker/CVE-2021-33034)\nThe syzbot tool found a bug in the Bluetooth subsystem that could\n lead to a use-after-free. A local user could use this to cause a\n denial of service (crash or memory corruption) or possibly for\n privilege escalation.\n\n\nFor Debian 9 stretch, these problems have been fixed in version\n4.9.272-1. This update additionally includes many more bug fixes from\nstable updates 4.9.259-4.9.272 inclusive.\n\n\nWe recommend that you upgrade your linux packages.\n\n\nFor the detailed security status of linux please refer to\nits security tracker page at:\n<https://security-tracker.debian.org/tracker/linux>\n\n\nFurther information about Debian LTS security advisories, how to apply\nthese updates to your system and frequently asked questions can be\nfound at: <https://wiki.debian.org/LTS>\n\n\n",
	"affected": [
		{
			"package": {
				"ecosystem": "Debian:9",
				"name": "linux",
				"purl": "pkg:deb/debian/linux?arch=source"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "4.9.272-1"
						}
					]
				}
			],
			"versions": [
				"4.9.107-1",
				"4.9.110-1",
				"4.9.110-2",
				"4.9.110-3",
				"4.9.110-3+deb9u1",
				"4.9.110-3+deb9u2",
				"4.9.110-3+deb9u3",
				"4.9.110-3+deb9u4",
				"4.9.110-3+deb9u5",
				"4.9.110-3+deb9u6",
				"4.9.130-1",
				"4.9.130-2",
				"4.9.135-1",
				"4.9.144-1",
				"4.9.144-2",
				"4.9.144-3",
				"4.9.144-3.1",
				"4.9.161-1",
				"4.9.168-1",
				"4.9.168-1+deb9u2",
				"4.9.168-1+deb9u3",
				"4.9.168-1+deb9u4",
				"4.9.168-1+deb9u5",
				"4.9.184-1",
				"4.9.185-1",
				"4.9.189-1",
				"4.9.189-2",
				"4.9.189-3",
				"4.9.189-3+deb9u1",
				"4.9.189-3+deb9u2",
				"4.9.210-1",
				"4.9.210-1+deb9u1",
				"4.9.228-1",
				"4.9.240-1",
				"4.9.240-2",
				"4.9.246-1",
				"4.9.246-2",
				"4.9.258-1",
				"4.9.30-2",
				"4.9.30-2+deb9u1",
				"4.9.30-2+deb9u2",
				"4.9.30-2+deb9u2~bpo8+1",
				"4.9.30-2+deb9u3",
				"4.9.30-2+deb9u4",
				"4.9.30-2+deb9u5",
				"4.9.30-2+deb9u5~bpo8+1",
				"4.9.47-1",
				"4.9.51-1",
				"4.9.51-1~bpo8+1",
				"4.9.65-1",
				"4.9.65-2",
				"4.9.65-3",
				"4.9.65-3+deb9u1",
				"4.9.65-3+deb9u1~bpo8+1",
				"4.9.65-3+deb9u2",
				"4.9.65-3+deb9u2~bpo8+1",
				"4.9.65-3~bpo8+1",
				"4.9.80-1",
				"4.9.80-2",
				"4.9.82-1+deb9u2",
				"4.9.82-1+deb9u3",
				"4.9.82-1+deb9u3~bpo8+1",
				"4.9.88-1",
				"4.9.88-1+deb9u1",
				"4.9.88-1+deb9u1~bpo8+1",
				"4.9.88-1~bpo8+1"
			],
			"database_specific": {
				"source": "https://storage.googleapis.com/debian-osv/dla-osv/DLA-2689-1.json"
			}
		}
	],
	"references": [
		{
			"type": "ADVISORY",
			"url": "https://www.debian.org/lts/security/2021/dla-2689"
		}
	]
}
