{
	"schema_version": "1.6.0",
	"id": "DSA-4699-1",
	"modified": "2023-10-16T00:25:16.746884Z",
	"published": "2020-06-09T00:00:00Z",
	"related": [
		"CVE-2019-19462",
		"CVE-2019-3016",
		"CVE-2020-0543",
		"CVE-2020-10711",
		"CVE-2020-10732",
		"CVE-2020-10751",
		"CVE-2020-10757",
		"CVE-2020-12114",
		"CVE-2020-12464",
		"CVE-2020-12768",
		"CVE-2020-12770",
		"CVE-2020-13143"
	],
	"summary": "linux - security update",
	"details": "\nSeveral vulnerabilities have been discovered in the Linux kernel that\nmay lead to a privilege escalation, denial of service or information\nleaks.\n\n\n* [CVE-2019-3016](https://security-tracker.debian.org/tracker/CVE-2019-3016)\nIt was discovered that the KVM implementation for x86 did not\n always perform TLB flushes when needed, if the paravirtualised\n TLB flush feature was enabled. This could lead to disclosure of\n sensitive information within a guest VM.\n* [CVE-2019-19462](https://security-tracker.debian.org/tracker/CVE-2019-19462)\nThe syzkaller tool found a missing error check in the relay\n library used to implement various files under debugfs. A local\n user permitted to access debugfs could use this to cause a denial\n of service (crash) or possibly for privilege escalation.\n* [CVE-2020-0543](https://security-tracker.debian.org/tracker/CVE-2020-0543)\nResearchers at VU Amsterdam discovered that on some Intel CPUs\n supporting the RDRAND and RDSEED instructions, part of a random\n value generated by these instructions may be used in a later\n speculative execution on any core of the same physical CPU.\n Depending on how these instructions are used by applications, a\n local user or VM guest could use this to obtain sensitive\n information such as cryptographic keys from other users or VMs.\n\n\nThis vulnerability can be mitigated by a microcode update, either\n as part of system firmware (BIOS) or through the intel-microcode\n package in Debian's non-free archive section. This kernel update\n only provides reporting of the vulnerability and the option to\n disable the mitigation if it is not needed.\n* [CVE-2020-10711](https://security-tracker.debian.org/tracker/CVE-2020-10711)\nMatthew Sheets reported NULL pointer dereference issues in the\n SELinux subsystem while receiving CIPSO packet with null category. A\n remote attacker can take advantage of this flaw to cause a denial of\n service (crash). Note that this issue does not affect the binary\n packages distributed in Debian as CONFIG\\_NETLABEL is not enabled.\n* [CVE-2020-10732](https://security-tracker.debian.org/tracker/CVE-2020-10732)\nAn information leak of kernel private memory to userspace was found\n in the kernel's implementation of core dumping userspace processes.\n* [CVE-2020-10751](https://security-tracker.debian.org/tracker/CVE-2020-10751)\nDmitry Vyukov reported that the SELinux subsystem did not properly\n handle validating multiple messages, which could allow a privileged\n attacker to bypass SELinux netlink restrictions.\n* [CVE-2020-10757](https://security-tracker.debian.org/tracker/CVE-2020-10757)\nFan Yang reported a flaw in the way mremap handled DAX hugepages,\n allowing a local user to escalate their privileges.\n* [CVE-2020-12114](https://security-tracker.debian.org/tracker/CVE-2020-12114)\nPiotr Krysiuk discovered a race condition between the umount and\n pivot\\_root operations in the filesystem core (vfs). A local user\n with the CAP\\_SYS\\_ADMIN capability in any user namespace could use\n this to cause a denial of service (crash).\n* [CVE-2020-12464](https://security-tracker.debian.org/tracker/CVE-2020-12464)\nKyungtae Kim reported a race condition in the USB core that can\n result in a use-after-free. It is not clear how this can be\n exploited, but it could result in a denial of service (crash or\n memory corruption) or privilege escalation.\n* [CVE-2020-12768](https://security-tracker.debian.org/tracker/CVE-2020-12768)\nA bug was discovered in the KVM implementation for AMD processors,\n which could result in a memory leak. The security impact of this\n is unclear.\n* [CVE-2020-12770](https://security-tracker.debian.org/tracker/CVE-2020-12770)\nIt was discovered that the sg (SCSI generic) driver did not\n correctly release internal resources in a particular error case.\n A local user permitted to access an sg device could possibly use\n this to cause a denial of service (resource exhaustion).\n* [CVE-2020-13143](https://security-tracker.debian.org/tracker/CVE-2020-13143)\nKyungtae Kim reported a potential heap out-of-bounds write in\n the USB gadget subsystem. A local user permitted to write to\n the gadget configuration filesystem could use this to cause a\n denial of service (crash or memory corruption) or potentially\n for privilege escalation.\n\n\nFor the stable distribution (buster), these problems have been fixed\nin version 4.19.118-2+deb10u1. This version also fixes some related\nbugs that do not have their own CVE IDs, and a regression in the\n<linux/swab.h> UAPI header introduced in the previous point release\n(bug #960271).\n\n\nWe recommend that you upgrade your linux packages.\n\n\nFor the detailed security status of linux please refer to its\nsecurity tracker page at:\n[\\\nhttps://security-tracker.debian.org/tracker/linux](https://security-tracker.debian.org/tracker/linux)\n\n\n",
	"affected": [
		{
			"package": {
				"ecosystem": "Debian:10",
				"name": "linux",
				"purl": "pkg:deb/debian/linux?arch=source"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "4.19.118-2+deb10u1"
						}
					]
				}
			],
			"versions": [
				"4.19.118-1",
				"4.19.118-2",
				"4.19.118-2+deb10u1~bpo9+1",
				"4.19.118-2~bpo9+1",
				"4.19.37-5",
				"4.19.37-5+deb10u1",
				"4.19.37-5+deb10u2",
				"4.19.37-5+deb10u2~bpo9+1",
				"4.19.37-6",
				"4.19.67-1",
				"4.19.67-2",
				"4.19.67-2+deb10u1",
				"4.19.67-2+deb10u1~bpo9+1",
				"4.19.67-2+deb10u2",
				"4.19.67-2+deb10u2~bpo9+1",
				"4.19.67-2~bpo9+1",
				"4.19.87-1",
				"4.19.98-1",
				"4.19.98-1+deb10u1",
				"4.19.98-1~bpo9+1"
			],
			"database_specific": {
				"source": "https://storage.googleapis.com/debian-osv/dsa-osv/DSA-4699-1.json"
			}
		}
	],
	"references": [
		{
			"type": "ADVISORY",
			"url": "https://www.debian.org/security/2020/dsa-4699"
		}
	]
}
