{
	"schema_version": "1.6.0",
	"id": "DSA-4830-2",
	"modified": "2023-10-16T00:22:12.565204Z",
	"published": "2021-01-14T00:00:00Z",
	"summary": "flatpak - regression update",
	"details": "\nSimon McVittie discovered a bug in the flatpak-portal service that can\nallow sandboxed applications to execute arbitrary code on the host system\n(a sandbox escape).\n\n\nThe Flatpak portal D-Bus service (flatpak-portal, also known by its\nD-Bus service name org.freedesktop.portal.Flatpak) allows apps in a\nFlatpak sandbox to launch their own subprocesses in a new sandbox\ninstance, either with the same security settings as the caller or\nwith more restrictive security settings. For example, this is used in\nFlatpak-packaged web browsers such as Chromium to launch subprocesses\nthat will process untrusted web content, and give those subprocesses a\nmore restrictive sandbox than the browser itself.\n\n\nIn vulnerable versions, the Flatpak portal service passes caller-specified\nenvironment variables to non-sandboxed processes on the host system,\nand in particular to the flatpak run command that is used to launch the\nnew sandbox instance. A malicious or compromised Flatpak app could set\nenvironment variables that are trusted by the flatpak run command, and\nuse them to execute arbitrary code that is not in a sandbox.\n\n\nFor the stable distribution (buster), this problem has been fixed in\nversion 1.2.5-0+deb10u2.\n\n\nWe recommend that you upgrade your flatpak packages.\n\n\nFor the detailed security status of flatpak please refer to\nits security tracker page at:\n[\\\nhttps://security-tracker.debian.org/tracker/flatpak](https://security-tracker.debian.org/tracker/flatpak)\n\n\n",
	"affected": [
		{
			"package": {
				"ecosystem": "Debian:10",
				"name": "flatpak",
				"purl": "pkg:deb/debian/flatpak?arch=source"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "1.2.5-0+deb10u3"
						}
					]
				}
			],
			"versions": [
				"1.2.4-1",
				"1.2.5-0+deb10u1",
				"1.2.5-0+deb10u1~bpo9+1",
				"1.2.5-0+deb10u2"
			],
			"database_specific": {
				"source": "https://storage.googleapis.com/debian-osv/dsa-osv/DSA-4830-2.json"
			}
		}
	],
	"references": [
		{
			"type": "ADVISORY",
			"url": "https://www.debian.org/security/2021/dsa-4830"
		}
	]
}
