{
	"schema_version": "1.6.0",
	"id": "DSA-2842-1",
	"modified": "2023-10-16T00:11:34.766828Z",
	"published": "2014-01-13T00:00:00Z",
	"related": [
		"CVE-2013-4152",
		"CVE-2013-7315"
	],
	"summary": "libspring-java - several",
	"details": "\nAlvaro Munoz discovered a XML External Entity (XXE) injection in the\nSpring Framework which can be used for conducting CSRF and DoS attacks\non other sites.\n\n\nThe Spring OXM wrapper did not expose any property for disabling entity\nresolution when using the JAXB unmarshaller. There are four possible\nsource implementations passed to the unmarshaller:\n\n\n* DOMSource\n* StAXSource\n* SAXSource\n* StreamSource\n\n\nFor a DOMSource, the XML has already been parsed by user code\nand that code is responsible for protecting against XXE.\n\n\nFor a StAXSource, the XMLStreamReader has already been created\nby user code and that code is responsible for protecting\nagainst XXE.\n\n\nFor SAXSource and StreamSource instances, Spring processed\nexternal entities by default thereby creating this\nvulnerability.\n\n\nThe issue was resolved by disabling external entity processing\nby default and adding an option to enable it for those users\nthat need to use this feature when processing XML from a\ntrusted source.\n\n\nIt was also identified that Spring MVC processed user provided\nXML with JAXB in combination with a StAX XMLInputFactory\nwithout disabling external entity resolution. External entity\nresolution has been disabled in this case.\n\n\nFor the stable distribution (wheezy), this problem has been fixed in\nversion 3.0.6.RELEASE-6+deb7u1.\n\n\nFor the unstable distribution (sid), this problem has been fixed in\nversion 3.0.6.RELEASE-10.\n\n\nWe recommend that you upgrade your libspring-java packages.\n\n\n",
	"affected": [
		{
			"package": {
				"ecosystem": "Debian:7",
				"name": "libspring-java",
				"purl": "pkg:deb/debian/libspring-java?arch=source"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "3.0.6.RELEASE-6+deb7u1"
						}
					]
				}
			],
			"versions": [
				"3.0.6.RELEASE-6"
			],
			"database_specific": {
				"source": "https://storage.googleapis.com/debian-osv/dsa-osv/DSA-2842-1.json"
			}
		}
	],
	"references": [
		{
			"type": "ADVISORY",
			"url": "https://www.debian.org/security/2014/dsa-2842"
		}
	]
}
