{
	"schema_version": "1.6.0",
	"id": "DLA-2385-1",
	"modified": "2023-06-28T06:26:32.102416Z",
	"published": "2020-09-28T00:00:00Z",
	"related": [
		"CVE-2019-19448",
		"CVE-2019-19813",
		"CVE-2019-19816",
		"CVE-2019-3874",
		"CVE-2020-10781",
		"CVE-2020-12888",
		"CVE-2020-14314",
		"CVE-2020-14331",
		"CVE-2020-14356",
		"CVE-2020-14385",
		"CVE-2020-14386",
		"CVE-2020-14390",
		"CVE-2020-16166",
		"CVE-2020-25212",
		"CVE-2020-25284",
		"CVE-2020-25285",
		"CVE-2020-25641",
		"CVE-2020-26088"
	],
	"summary": "linux-4.19 - security update",
	"details": "\nSeveral vulnerabilities have been discovered in the Linux kernel that\nmay lead to a privilege escalation, denial of service, or information\nleak.\n\n\n* [CVE-2019-3874](https://security-tracker.debian.org/tracker/CVE-2019-3874)\nKernel buffers allocated by the SCTP network protocol were not\n limited by the memory cgroup controller. A local user could\n potentially use this to evade container memory limits and to cause\n a denial of service (excessive memory use).\n* [CVE-2019-19448](https://security-tracker.debian.org/tracker/CVE-2019-19448), [CVE-2019-19813](https://security-tracker.debian.org/tracker/CVE-2019-19813), [CVE-2019-19816](https://security-tracker.debian.org/tracker/CVE-2019-19816)\nTeam bobfuzzer reported bugs in Btrfs that could lead to a\n use-after-free or heap buffer overflow, and could be triggered by\n crafted filesystem images. A user permitted to mount and access\n arbitrary filesystems could use these to cause a denial of service\n (crash or memory corruption) or possibly for privilege escalation.\n* [CVE-2020-10781](https://security-tracker.debian.org/tracker/CVE-2020-10781)\nLuca Bruno of Red Hat discovered that the zram control file\n /sys/class/zram-control/hot\\_add was readable by all users. On a\n system with zram enabled, a local user could use this to cause a\n denial of service (memory exhaustion).\n* [CVE-2020-12888](https://security-tracker.debian.org/tracker/CVE-2020-12888)\nIt was discovered that the PCIe Virtual Function I/O (vfio-pci)\n driver allowed users to disable a device's memory space while it\n was still mapped into a process. On some hardware platforms,\n local users or guest virtual machines permitted to access PCIe\n Virtual Functions could use this to cause a denial of service\n (hardware error and crash).\n* [CVE-2020-14314](https://security-tracker.debian.org/tracker/CVE-2020-14314)\nA bug was discovered in the ext4 filesystem that could lead to an\n out-of-bound read. A local user permitted to mount and access\n arbitrary filesystem images could use this to cause a denial of\n service (crash).\n* [CVE-2020-14331](https://security-tracker.debian.org/tracker/CVE-2020-14331)\nA bug was discovered in the VGA console driver's soft-scrollback\n feature that could lead to a heap buffer overflow. On a system\n with a custom kernel that has CONFIG\\_VGACON\\_SOFT\\_SCROLLBACK\n enabled, a local user with access to a console could use this to\n cause a denial of service (crash or memory corruption) or possibly\n for privilege escalation.\n* [CVE-2020-14356](https://security-tracker.debian.org/tracker/CVE-2020-14356)\nA bug was discovered in the cgroup subsystem's handling of socket\n references to cgroups. In some cgroup configurations, this could\n lead to a use-after-free. A local user might be able to use this\n to cause a denial of service (crash or memory corruption) or\n possibly for privilege escalation.\n* [CVE-2020-14385](https://security-tracker.debian.org/tracker/CVE-2020-14385)\nA bug was discovered in XFS, which could lead to an extended\n attribute (xattr) wrongly being detected as invalid. A local user\n with access to an XFS filesystem could use this to cause a denial\n of service (filesystem shutdown).\n* [CVE-2020-14386](https://security-tracker.debian.org/tracker/CVE-2020-14386)\nOr Cohen discovered a bug in the packet socket (AF\\_PACKET)\n implementation which could lead to a heap buffer overflow. A\n local user with the CAP\\_NET\\_RAW capability (in any user namespace)\n could use this to cause a denial of service (crash or memory\n corruption) or possibly for privilege escalation.\n* [CVE-2020-14390](https://security-tracker.debian.org/tracker/CVE-2020-14390)\nMinh Yuan discovered a bug in the framebuffer console driver's\n scrollback feature that could lead to a heap buffer overflow. On\n a system using framebuffer consoles, a local user with access to a\n console could use this to cause a denial of service (crash or\n memory corruption) or possibly for privilege escalation.\n\n\nThe scrollback feature has been disabled for now, as no other fix\n was available for this issue.\n* [CVE-2020-16166](https://security-tracker.debian.org/tracker/CVE-2020-16166)\nAmit Klein reported that the random number generator used by the\n network stack might not be re-seeded for long periods of time,\n making e.g. client port number allocations more predictable. This\n made it easier for remote attackers to carry out some network-based\n attacks such as DNS cache poisoning or device tracking.\n* [CVE-2020-25212](https://security-tracker.debian.org/tracker/CVE-2020-25212)\nA bug was discovered in the NFSv4 client implementation that could\n lead to a heap buffer overflow. A malicious NFS server could use\n this to cause a denial of service (crash or memory corruption) or\n possibly to execute arbitrary code on the client.\n* [CVE-2020-25284](https://security-tracker.debian.org/tracker/CVE-2020-25284)\nIt was discovered that the Rados block device (rbd) driver allowed\n tasks running as uid 0 to add and remove rbd devices, even if they\n dropped capabilities. On a system with the rbd driver loaded,\n this might allow privilege escalation from a container with a task\n running as root.\n* [CVE-2020-25285](https://security-tracker.debian.org/tracker/CVE-2020-25285)\nA race condition was discovered in the hugetlb filesystem's sysctl\n handlers, that could lead to stack corruption. A local user\n permitted to write to hugepages sysctls could use this to cause a\n denial of service (crash or memory corruption) or possibly for\n privilege escalation. By default only the root user can do this.\n* [CVE-2020-25641](https://security-tracker.debian.org/tracker/CVE-2020-25641)\nThe syzbot tool found a bug in the block layer that could lead to\n an infinite loop. A local user with access to a raw block device\n could use this to cause a denial of service (unbounded CPU use and\n possible system hang).\n* [CVE-2020-26088](https://security-tracker.debian.org/tracker/CVE-2020-26088)\nIt was discovered that the NFC (Near Field Communication) socket\n implementation allowed any user to create raw sockets. On a\n system with an NFC interface, this allowed local users to evade\n local network security policy.\n\n\nFor Debian 9 stretch, these problems have been fixed in version\n4.19.146-1~deb9u1. This update additionally fixes Debian bugs\n[#966846](https://bugs.debian.org/966846), [#966917](https://bugs.debian.org/966917), and [#968567](https://bugs.debian.org/968567); and includes many more bug fixes from\nstable updates 4.19.133-4.19.146 inclusive.\n\n\nWe recommend that you upgrade your linux-4.19 packages.\n\n\nFor the detailed security status of linux-4.19 please refer to\nits security tracker page at:\n<https://security-tracker.debian.org/tracker/linux-4.19>\n\n\nFurther information about Debian LTS security advisories, how to apply\nthese updates to your system and frequently asked questions can be\nfound at: <https://wiki.debian.org/LTS>\n\n\n",
	"affected": [
		{
			"package": {
				"ecosystem": "Debian:9",
				"name": "linux-4.19",
				"purl": "pkg:deb/debian/linux-4.19?arch=source"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "4.19.146-1~deb9u1"
						}
					]
				}
			],
			"versions": [
				"4.19.132-1~deb9u1",
				"4.19.132-1~deb9u2"
			],
			"database_specific": {
				"source": "https://storage.googleapis.com/debian-osv/dla-osv/DLA-2385-1.json"
			}
		}
	],
	"references": [
		{
			"type": "ADVISORY",
			"url": "https://www.debian.org/lts/security/2020/dla-2385"
		}
	]
}
