{
	"schema_version": "1.6.0",
	"id": "DLA-2483-1",
	"modified": "2023-06-28T06:26:34.614269Z",
	"published": "2020-12-05T00:00:00Z",
	"related": [
		"CVE-2019-19039",
		"CVE-2019-19377",
		"CVE-2019-19770",
		"CVE-2019-19816",
		"CVE-2020-0423",
		"CVE-2020-14351",
		"CVE-2020-25656",
		"CVE-2020-25668",
		"CVE-2020-25669",
		"CVE-2020-25704",
		"CVE-2020-25705",
		"CVE-2020-27673",
		"CVE-2020-27675",
		"CVE-2020-27777",
		"CVE-2020-28941",
		"CVE-2020-28974",
		"CVE-2020-4788",
		"CVE-2020-8694"
	],
	"summary": "linux-4.19 - security update",
	"details": "\nSeveral vulnerabilities have been discovered in the Linux kernel that\nmay lead to the execution of arbitrary code, privilege escalation,\ndenial of service or information leaks.\n\n\n* [CVE-2019-19039](https://security-tracker.debian.org/tracker/CVE-2019-19039)\nTeam bobfuzzer reported a bug in Btrfs that could lead to an\n assertion failure (WARN). A user permitted to mount and access\n arbitrary filesystems could use this to cause a denial of service\n (crash) if the panic\\_on\\_warn kernel parameter is set.\n* [CVE-2019-19377](https://security-tracker.debian.org/tracker/CVE-2019-19377)\nTeam bobfuzzer reported a bug in Btrfs that could lead to a\n use-after-free. A user permitted to mount and access arbitrary\n filesystems could use this to cause a denial of service (crash or\n memory corruption) or possibly for privilege escalation.\n* [CVE-2019-19770](https://security-tracker.debian.org/tracker/CVE-2019-19770)\nThe syzbot tool discovered a race condition in the block I/O\n tracer (blktrace) that could lead to a system crash. Since\n blktrace can only be controlled by privileged users, the security\n impact of this is unclear.\n* [CVE-2019-19816](https://security-tracker.debian.org/tracker/CVE-2019-19816)\nTeam bobfuzzer reported a bug in Btrfs that could lead to an\n out-of-bounds write. A user permitted to mount and access\n arbitrary filesystems could use this to cause a denial of service\n (crash or memory corruption) or possibly for privilege escalation.\n* [CVE-2020-0423](https://security-tracker.debian.org/tracker/CVE-2020-0423)\nA race condition was discovered in the Android binder driver, that\n could result in a use-after-free. On systems using this driver, a\n local user could use this to cause a denial of service (crash or\n memory corruption) or possibly for privilege escalation.\n* [CVE-2020-8694](https://security-tracker.debian.org/tracker/CVE-2020-8694)\nMultiple researchers discovered that the powercap subsystem\n allowed all users to read CPU energy meters, by default. On\n systems using Intel CPUs, this provided a side channel that could\n leak sensitive information between user processes, or from the\n kernel to user processes. The energy meters are now readable only\n by root, by default.\n\n\nThis issue can be mitigated by running:\n\n\n`chmod go-r /sys/devices/virtual/powercap/*/*/energy_uj`\n\n\nThis needs to be repeated each time the system is booted with\n an unfixed kernel version.\n* [CVE-2020-14351](https://security-tracker.debian.org/tracker/CVE-2020-14351)\nA race condition was discovered in the performance events\n subsystem, which could lead to a use-after-free. A local user\n permitted to access performance events could use this to cause a\n denial of service (crash or memory corruption) or possibly for\n privilege escalation.\n\n\nDebian's kernel configuration does not allow unprivileged users to\n access peformance events by default, which fully mitigates this\n issue.\n* [CVE-2020-25656](https://security-tracker.debian.org/tracker/CVE-2020-25656)\nYuan Ming and Bodong Zhao discovered a race condition in the\n virtual terminal (vt) driver that could lead to a use-after-free.\n A local user with the CAP\\_SYS\\_TTY\\_CONFIG capability could use this\n to cause a denial of service (crash or memory corruption) or\n possibly for privilege escalation.\n* [CVE-2020-25668](https://security-tracker.debian.org/tracker/CVE-2020-25668)\nYuan Ming and Bodong Zhao discovered a race condition in the\n virtual terminal (vt) driver that could lead to a use-after-free.\n A local user with access to a virtual terminal, or with the\n CAP\\_SYS\\_TTY\\_CONFIG capability, could use this to cause a denial of\n service (crash or memory corruption) or possibly for privilege\n escalation.\n* [CVE-2020-25669](https://security-tracker.debian.org/tracker/CVE-2020-25669)\nBodong Zhao discovered a bug in the Sun keyboard driver (sunkbd)\n that could lead to a use-after-free. On a system using this\n driver, a local user could use this to cause a denial of service\n (crash or memory corruption) or possibly for privilege escalation.\n* [CVE-2020-25704](https://security-tracker.debian.org/tracker/CVE-2020-25704)\nkiyin(ĺ°šäşŽ) discovered a potential memory leak in the performance\n events subsystem. A local user permitted to access performance\n events could use this to cause a denial of service (memory\n exhaustion).\n\n\nDebian's kernel configuration does not allow unprivileged users to\n access peformance events by default, which fully mitigates this\n issue.\n* [CVE-2020-25705](https://security-tracker.debian.org/tracker/CVE-2020-25705)\nKeyu Man reported that strict rate-limiting of ICMP packet\n transmission provided a side-channel that could help networked\n attackers to carry out packet spoofing. In particular, this made\n it practical for off-path networked attackers to poison DNS\n caches with spoofed responses (\"SAD DNS\" attack).\n\n\nThis issue has been mitigated by randomising whether packets are\n counted against the rate limit.\n* [CVE-2020-27673](https://security-tracker.debian.org/tracker/CVE-2020-27673) / [XSA-332](https://xenbits.xen.org/xsa/advisory-332.html)\nJulien Grall from Arm discovered a bug in the Xen event handling\n code. Where Linux was used in a Xen dom0, unprivileged (domU)\n guests could cause a denial of service (excessive CPU usage or\n hang) in dom0.\n* [CVE-2020-27675](https://security-tracker.debian.org/tracker/CVE-2020-27675) / [XSA-331](https://xenbits.xen.org/xsa/advisory-331.html)\nJinoh Kang of Theori discovered a race condition in the Xen event\n handling code. Where Linux was used in a Xen dom0, unprivileged\n (domU) guests could cause a denial of service (crash) in dom0.\n* [CVE-2020-28941](https://security-tracker.debian.org/tracker/CVE-2020-28941)\nShisong Qin and Bodong Zhao discovered a bug in the Speakup screen\n reader subsystem. Speakup assumed that it would only be bound to\n one terminal (tty) device at a time, but did not enforce this. A\n local user could exploit this bug to cause a denial of service\n (crash or memory exhaustion).\n* [CVE-2020-28974](https://security-tracker.debian.org/tracker/CVE-2020-28974)\nYuan Ming discovered a bug in the virtual terminal (vt) driver\n that could lead to an out-of-bounds read. A local user with\n access to a virtual terminal, or with the CAP\\_SYS\\_TTY\\_CONFIG\n capability, could possibly use this to obtain sensitive\n information from the kernel or to cause a denial of service\n (crash).\n\n\nThe specific ioctl operation affected by this bug\n (KD\\_FONT\\_OP\\_COPY) has been disabled, as it is not believed that\n any programs depended on it.\n\n\nFor Debian 9 stretch, these problems have been fixed in version\n4.19.160-2~deb9u1.\n\n\nWe recommend that you upgrade your linux-4.19 packages.\n\n\nFor the detailed security status of linux-4.19 please refer to\nits security tracker page at:\n<https://security-tracker.debian.org/tracker/linux-4.19>\n\n\nFurther information about Debian LTS security advisories, how to apply\nthese updates to your system and frequently asked questions can be\nfound at: <https://wiki.debian.org/LTS>\n\n\n",
	"affected": [
		{
			"package": {
				"ecosystem": "Debian:9",
				"name": "linux-4.19",
				"purl": "pkg:deb/debian/linux-4.19?arch=source"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "4.19.160-2~deb9u1"
						}
					]
				}
			],
			"versions": [
				"4.19.132-1~deb9u1",
				"4.19.132-1~deb9u2",
				"4.19.146-1~deb9u1",
				"4.19.152-1~deb9u1"
			],
			"database_specific": {
				"source": "https://storage.googleapis.com/debian-osv/dla-osv/DLA-2483-1.json"
			}
		}
	],
	"references": [
		{
			"type": "ADVISORY",
			"url": "https://www.debian.org/lts/security/2020/dla-2483"
		}
	]
}
