{
	"schema_version": "1.6.0",
	"id": "DSA-380",
	"modified": "2019-03-31T21:35:49Z",
	"published": "2003-09-12T00:00:00Z",
	"related": [
		"CVE-2002-0164",
		"CVE-2003-0063",
		"CVE-2003-0071",
		"CVE-2003-0730"
	],
	"summary": "xfree86 - buffer overflows, denial of service",
	"details": "\nFour vulnerabilities have been discovered in XFree86.\n\n\n* [CAN-2003-0063](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CAN-2003-0063)\n- xterm window title reporting escape sequence can deceive user\n\nThe xterm package provides a terminal escape sequence that reports\n the window title by injecting it into the input buffer of the\n terminal window, as if the user had typed it. An attacker can craft\n an escape sequence that sets the title of a victim's xterm window to\n an arbitrary string (such as a shell command) and then reports that\n title. If the victim is at a shell prompt when this is done, the\n injected command will appear on the command line, ready to be run.\n Since it is not possible to embed a carriage return in the window\n title, the attacker would have to convince the victim to press Enter\n (or rely upon the victim's careless or confusion) for the shell or\n other interactive process to interpret the window title as user\n input. It is conceivable that the attacker could craft other escape\n sequences that might convince the victim to accept the injected\n input, however. The Common Vulnerabilities and Exposures project at\n cve.mitre.org has assigned the name\n [CAN-2003-0063](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CAN-2003-0063)\n to this issue.\n\n\nTo determine whether your version of xterm is vulnerable to abuse of\n the window title reporting feature, run the following command at a\n shell prompt from within an xterm window:\n\n\n\n echo -e \"\\e[21t\"\n\n(The terminal bell may ring, and the window title may be prefixed\n with an \"l\".)\n\n\nThis flaw is exploitable by anything that can send output to a\n terminal window, such as a text document. The xterm user has to\n take action to cause the escape sequence to be sent, however (such\n as by viewing a malicious text document with the \"cat\" command).\n Whether you are likely to be exposed to it depends on how you use\n xterm. Consider the following:\n\n\n\n echo -e '\\e]2;s && echo rm -rf \\*\\a' > /tmp/sploit\n echo -e '\\e[21t' >> /tmp/sploit\n cat /tmp/sploit\n\nDebian has resolved this problem by disabling the window title\n reporting escape sequence in xterm; it is understood but ignored.\n The escape sequence to set the window title has not been disabled.\n\n\nA future release of the xterm package will have a configuration\n option to permit the user to turn the window title reporting feature\n back on, but it will default off.\n* [CAN-2003-0071](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CAN-2003-0071)\n- xterm susceptible to DEC UDK escape sequence denial-of-service attack\n\nThe xterm package, since it emulates DEC VT-series text terminals,\n emulates a feature of DEC VT terminals known as \"User-Defined Keys\"\n (UDK for short). There is a bug in xterm's handling of DEC UDK\n escape sequences, however, and an ill-formed one can cause the xterm\n process to enter a tight loop. This causes the process to \"spin\",\n consuming CPU cycles uselessly, and refusing to handle signals (such\n as efforts to kill the process or close the window).\n\n\nTo determine whether your version of xterm is vulnerable to this\n attack, run the following command at a shell prompt from within a\n \"sacrificial\" xterm window (i.e., one that doesn't have anything in\n the scrollback buffer you might need to see later):\n\n\n\n echo -e \"\\eP0;0|0A/17\\x9c\"\n\nThis flaw is exploitable by anything that can send output to a\n terminal window, such as a text document. The xterm user has to\n take action to cause the escape sequence to be sent, however (such\n as by viewing a malicious text document with the \"cat\" command).\n Whether you are likely to be exposed to it depends on how you use\n xterm.\n\n\nDebian has resolved this problem by backporting an upstream fix\n to XFree86 4.1.0.\n* [CAN-2002-0164](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CAN-2002-0164)\n- flaw in X server's MIT-SHM extension permits user owning X session to read\nand write arbitrary shared memory segments\n\nMost X servers descended from the MIT/X Consortium/X.Org Sample\n Implementation, including XFree86's X servers, support an extension\n to the X protocol called MIT-SHM, which enables X clients running on\n the same host as the X server to operate more quickly and\n efficiently by taking advantage of an operating system feature\n called shared memory where it is available. The Linux kernel, for\n example, supports shared memory.\n\n\nBecause the X server runs with elevated privileges, the operating\n system's built-in access control mechanisms are ineffective to\n police the X server's usage of segments of shared memory. The X\n server has to implement its own access control. This was\n imperfectly done in previous releases of XFree86 (and the MIT/X\n Consortium/X.Org Sample Implementation before it), leaving\n opportunities for malicious X clients to read and alter shared\n memory segments to which they should not have access. The Common\n Vulnerabilities and Exposures project at cve.mitre.org has assigned\n the name\n [CAN-2002-0164](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CAN-2002-0164)\n to this issue.\n\n\nDebian's XFree86 4.1.0-16 packages shipped with an incomplete fix\n for the this flaw, only enforcing proper access control for X\n servers that were not started by a display manager (e.g., xdm).\n This update resolves that problem.\n\n\nThe Debian Project knows of no exploits for this vulnerability. A\n malicious X client that abused the MIT-SHM extension could\n conceivably be written however, and run (deliberately or\n unwittingly) by a user able to run an X server on a host. The\n impact of this flaw depends on how shared memory is used on the\n system. See the ipcs(8) manual page for more information.\n\n\nDebian has resolved this problem by backporting an upstream fix to\n XFree86 4.1.0.\n* [CAN-2003-0730](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CAN-2003-0730)\n- multiple integer overflows in the font libraries for XFree86 allow local or\nremote attackers to cause a denial of service or execute arbitrary code via\nheap-based and stack-based buffer overflow attacks\n\nSecurity researcher \"blexim\" wrote [paraphrased]:\n\n\n\n> \n> I have identified several bugs in the font libraries of the\n>  current version of the XFree86 source code. These bugs could\n>  potentially lead to the execution of arbitrary code by a remote\n>  user in any process which calls the functions in question. The\n>  functions are related to the transfer and enumeration of fonts\n>  from font servers to clients, limiting the range of the exposure\n>  caused by these bugs.\n> \n> \n> Specifically, several sizing variables passed from a font server\n>  to a client are not adequately checked, causing calculations on\n>  them to result in erroneous values. These erroneous calculations\n>  can lead to buffers on the heap and stack overflowing, potentially\n>  leading to arbitrary code execution. As stated before, the risk\n>  is limited by the fact that only clients can be affected by these\n>  bugs, but in some (non-default) configurations, both xfs and the X\n>  server can act as clients to remote font servers. In these\n>  configurations, both xfs and the X server could be potentially\n>  compromised.\n> \n> \n> \n\n\nThe Common Vulnerabilities and Exposures project at cve.mitre.org\n has assigned the name\n [CAN-2003-0730](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CAN-2003-0730)\n to this issue.\n\n\nThe Debian Project knows of no exploits for this vulnerability. By\n default in Debian, X servers are configured to listen only to a\n locally-running font server, which is not even used if the xfs\n package is not installed. The Debian default configuration of xfs\n uses only font directories on the local host, and does not attempt\n to connect to any external font servers.\n\n\nDebian has resolved this problem by backporting an upstream fix to\n XFree86 4.1.0.\n\n\nAll of the above problems also affect the xfree86v3 packages (in the\ncase of the first two flaws, the xterm source code contains the flaws,\nbut no xterm package is produced). Due to resource limitations and a\nlack of upstream support for this legacy code, Debian is unable to\ncontinue supporting version 3.3.6 of XFree86. To avoid exposure to\nthe latter two flaws in this advisory, we recommend that you remove\nthe following packages if you have them installed:\n\n\n* xserver-3dlabs\n* xserver-8514\n* xserver-agx\n* xserver-common-v3\n* xserver-fbdev\n* xserver-i128\n* xserver-mach32\n* xserver-mach64\n* xserver-mach8\n* xserver-mono\n* xserver-p9000\n* xserver-s3\n* xserver-s3v\n* xserver-svga\n* xserver-tga\n* xserver-vga16\n* xserver-w32\n\n\n(You may also wish to remove the xext, xlib6, and xlib6-altdev packages,\nas support for them is being terminated along with the rest of the\nXFree86 3.3.6 packages, though they are not affected by the flaws in\nthis advisory.)\n\n\nFor the stable distribution (woody) these problems have been fixed in\nversion 4.1.0-16woody1.\n\n\nFor the unstable distribution (sid) all problems except\n[CAN-2003-0730](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CAN-2003-0730)\nare fixed in version 4.2.1-11.\n[CAN-2003-0730](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CAN-2003-0730)\nwill be fixed in 4.2.1-12, currently in preparation.\n\n\nWe recommend that you update your xfree86 package.\n\n\n",
	"affected": [
		{
			"package": {
				"ecosystem": "Debian:3.0",
				"name": "xfree86",
				"purl": "pkg:deb/debian/xfree86?arch=source"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "4.1.0-16woody1"
						}
					]
				}
			],
			"database_specific": {
				"source": "https://storage.googleapis.com/debian-osv/dsa-osv/DSA-380.json"
			}
		}
	],
	"references": [
		{
			"type": "ADVISORY",
			"url": "https://www.debian.org/security/2003/dsa-380"
		}
	]
}
