{
	"schema_version": "1.6.0",
	"id": "DSA-307",
	"modified": "2014-04-29T17:19:40Z",
	"published": "2003-05-27T00:00:00Z",
	"related": [
		"CVE-2003-0360",
		"CVE-2003-0361",
		"CVE-2003-0362"
	],
	"summary": "gps - multiple vulnerabilities",
	"details": "\ngPS is a graphical application to watch system processes. In release\n1.1.0 of the gps package, several security vulnerabilities were fixed,\nas detailed in the changelog:\n\n\n* bug fix on rgpsp connection source acceptation policy\n (it was allowing any host to connect even when the\n /etc/rgpsp.conf file told otherwise).\n It is working now, but on any real (\"production\")\n network I suggest you use IP filtering to enforce\n the policy (like ipchains or iptables).\n* Several possibilities of buffer overflows have been\n fixed. Thanks to Stanislav Ievlev from ALT-Linux for\n pointing a lot of them.\n* fixed misformatting of command line parameters in\n rgpsp protocol (command lines with newlines would\n break the protocol).\n* fixed buffer overflow bug that caused rgpsp\n to SIGSEGV when stating processes with large\n command lines (>128 chars) [Linux only].\n\n\nAll of these problems affect Debian's gps package version 0.9.4-1 in\nDebian woody. Debian potato also contains a gps package (version\n0.4.1-2), but it is not affected by these problems, as the relevant\nfunctionality is not implemented in that version.\n\n\nFor the stable distribution (woody) these problems have been fixed in\nversion 0.9.4-1woody1.\n\n\nThe old stable distribution (potato) is not affected by these problems.\n\n\nFor the unstable distribution (sid) these problems are fixed in\nversion 1.1.0-1.\n\n\nWe recommend that you update your gps package.\n\n\n",
	"affected": [
		{
			"package": {
				"ecosystem": "Debian:3.0",
				"name": "gps",
				"purl": "pkg:deb/debian/gps?arch=source"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "0.9.4-1woody1"
						}
					]
				}
			],
			"database_specific": {
				"source": "https://storage.googleapis.com/debian-osv/dsa-osv/DSA-307.json"
			}
		}
	],
	"references": [
		{
			"type": "ADVISORY",
			"url": "https://www.debian.org/security/2003/dsa-307"
		}
	]
}
