{
	"schema_version": "1.6.0",
	"id": "DSA-228",
	"modified": "2023-10-16T00:11:05.558694Z",
	"published": "2003-01-14T00:00:00Z",
	"related": [
		"CVE-2003-0031",
		"CVE-2003-0032"
	],
	"summary": "libmcrypt - buffer overflows and memory leak",
	"details": "\nIlia Alshanetsky discovered several buffer overflows in libmcrypt, a\ndecryption and encryption library, that originates from improper or\nlacking input validation. By passing input which is longer than\nexpected to a number of functions (multiple functions are affected)\nthe user can successfully make libmcrypt crash and may be able to insert\narbitrary, malicious code which will be executed under the user\nlibmcrypt runs as, e.g. inside a web server.\n\n\nAnother vulnerability exists in the way libmcrypt loads algorithms via\nlibtool. When different algorithms are loaded dynamically, each time\nan algorithm is loaded a small part of memory is leaked. In a\npersistent environment (web server) this could lead to a memory\nexhaustion attack that will exhaust all available memory by launching\nrepeated requests at an application utilizing the mcrypt library.\n\n\nFor the current stable distribution (woody) these problems have been\nfixed in version 2.5.0-1woody1.\n\n\nThe old stable distribution (potato) does not contain libmcrypt packages.\n\n\nFor the unstable distribution (sid) these problems have been fixed in\nversion 2.5.5-1.\n\n\nWe recommend that you upgrade your libmcrypt packages.\n\n\n",
	"affected": [
		{
			"package": {
				"ecosystem": "Debian:3.0",
				"name": "libmcrypt",
				"purl": "pkg:deb/debian/libmcrypt?arch=source"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "2.5.0-1woody1"
						}
					]
				}
			],
			"versions": [
				"2.5.0-1"
			],
			"database_specific": {
				"source": "https://storage.googleapis.com/debian-osv/dsa-osv/DSA-228.json"
			}
		}
	],
	"references": [
		{
			"type": "ADVISORY",
			"url": "https://www.debian.org/security/2003/dsa-228"
		}
	]
}
