{
	"schema_version": "1.6.0",
	"id": "DSA-2669-1",
	"modified": "2023-10-16T00:06:03.325359Z",
	"published": "2013-05-15T00:00:00Z",
	"related": [
		"CVE-2013-0160",
		"CVE-2013-1796",
		"CVE-2013-1929",
		"CVE-2013-1979",
		"CVE-2013-2015",
		"CVE-2013-2094",
		"CVE-2013-2141",
		"CVE-2013-3076",
		"CVE-2013-3222",
		"CVE-2013-3223",
		"CVE-2013-3224",
		"CVE-2013-3225",
		"CVE-2013-3227",
		"CVE-2013-3228",
		"CVE-2013-3229",
		"CVE-2013-3231",
		"CVE-2013-3234",
		"CVE-2013-3235",
		"CVE-2013-3301"
	],
	"summary": "linux - several",
	"details": "\nSeveral vulnerabilities have been discovered in the Linux kernel that may lead\nto a denial of service, information leak or privilege escalation. The Common\nVulnerabilities and Exposures project identifies the following problems:\n\n\n* [CVE-2013-0160](https://security-tracker.debian.org/tracker/CVE-2013-0160)\nvladz reported a timing leak with the /dev/ptmx character device. A local\n user could use this to determine sensitive information such as password\n length.\n* [CVE-2013-1796](https://security-tracker.debian.org/tracker/CVE-2013-1796)\nAndrew Honig of Google reported an issue in the KVM subsystem. A user in\n a guest operating system could corrupt kernel memory, resulting in a\n denial of service.\n* [CVE-2013-1929](https://security-tracker.debian.org/tracker/CVE-2013-1929)\nOded Horovitz and Brad Spengler reported an issue in the device driver for\n Broadcom Tigon3 based gigabit Ethernet. Users with the ability to attach\n untrusted devices can create an overflow condition, resulting in a denial\n of service or elevated privileges.\n* [CVE-2013-1979](https://security-tracker.debian.org/tracker/CVE-2013-1979)\nAndy Lutomirski reported an issue in the socket level control message\n processing subsystem. Local users may be able to gain eleveated privileges.\n* [CVE-2013-2015](https://security-tracker.debian.org/tracker/CVE-2013-2015)\nTheodore Ts'o provided a fix for an issue in the ext4 filesystem. Local\n users with the ability to mount a specially crafted filesystem can cause\n a denial of service (infinite loop).\n* [CVE-2013-2094](https://security-tracker.debian.org/tracker/CVE-2013-2094)\nTommie Rantala discovered an issue in the perf subsystem. An out-of-bounds\n access vulnerability allows local users to gain elevated privileges.\n* [CVE-2013-3076](https://security-tracker.debian.org/tracker/CVE-2013-3076)\nMathias Krause discovered an issue in the userspace interface for hash\n algorithms. Local users can gain access to sensitive kernel memory.\n* [CVE-2013-3222](https://security-tracker.debian.org/tracker/CVE-2013-3222)\nMathias Krause discovered an issue in the Asynchronous Transfer Mode (ATM)\n protocol support. Local users can gain access to sensitive kernel memory.\n* [CVE-2013-3223](https://security-tracker.debian.org/tracker/CVE-2013-3223)\nMathias Krause discovered an issue in the Amateur Radio AX.25 protocol\n support. Local users can gain access to sensitive kernel memory.\n* [CVE-2013-3224](https://security-tracker.debian.org/tracker/CVE-2013-3224)\nMathias Krause discovered an issue in the Bluetooth subsystem. Local users\n can gain access to sensitive kernel memory.\n* [CVE-2013-3225](https://security-tracker.debian.org/tracker/CVE-2013-3225)\nMathias Krause discovered an issue in the Bluetooth RFCOMM protocol\n support. Local users can gain access to sensitive kernel memory.\n* [CVE-2013-3227](https://security-tracker.debian.org/tracker/CVE-2013-3227)\nMathias Krause discovered an issue in the Communication CPU to Application\n CPU Interface (CAIF). Local users can gain access to sensitive kernel\n memory.\n* [CVE-2013-3228](https://security-tracker.debian.org/tracker/CVE-2013-3228)\nMathias Krause discovered an issue in the IrDA (infrared) subsystem\n support. Local users can gain access to sensitive kernel memory.\n* [CVE-2013-3229](https://security-tracker.debian.org/tracker/CVE-2013-3229)\nMathias Krause discovered an issue in the IUCV support on s390 systems.\n Local users can gain access to sensitive kernel memory.\n* [CVE-2013-3231](https://security-tracker.debian.org/tracker/CVE-2013-3231)\nMathias Krause discovered an issue in the ANSI/IEEE 802.2 LLC type 2\n protocol support. Local users can gain access to sensitive kernel memory.\n* [CVE-2013-3234](https://security-tracker.debian.org/tracker/CVE-2013-3234)\nMathias Krause discovered an issue in the Amateur Radio X.25 PLP (Rose)\n protocol support. Local users can gain access to sensitive kernel memory.\n* [CVE-2013-3235](https://security-tracker.debian.org/tracker/CVE-2013-3235)\nMathias Krause discovered an issue in the Transparent Inter Process\n Communication (TIPC) protocol support. Local users can gain access to\n sensitive kernel memory.\n* [CVE-2013-3301](https://security-tracker.debian.org/tracker/CVE-2013-3301)\nNamhyung Kim reported an issue in the tracing subsystem. A privileged\n local user could cause a denial of service (system crash). This\n vulnerabililty is not applicable to Debian systems by default.\n\n\nFor the stable distribution (wheezy), this problem has been fixed in version\n3.2.41-2+deb7u1.\n**Note**: Updates are currently available for the amd64, i386, ia64, s390, s390x\nand sparc architectures. Updates for the remaining architectures will be\nreleased as they become available.\n\n\nThe following matrix lists additional source packages that were rebuilt for\ncompatibility with or to take advantage of this update:\n\n\n\n\n\n|  | Debian 7.0 (wheezy) |\n| --- | --- |\n| user-mode-linux | 3.2-2um-1+deb7u1 |\n\n\n\nWe recommend that you upgrade your linux and user-mode-linux packages.\n**Note**: Debian carefully tracks all known security issues across every\nlinux kernel package in all releases under active security support.\nHowever, given the high frequency at which low-severity security\nissues are discovered in the kernel and the resource requirements of\ndoing an update, updates for lower priority issues will normally not\nbe released for all kernels at the same time. Rather, they will be\nreleased in a staggered or \"leap-frog\" fashion.\n\n\n\n\n\n\n",
	"affected": [
		{
			"package": {
				"ecosystem": "Debian:7",
				"name": "linux",
				"purl": "pkg:deb/debian/linux?arch=source"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "3.2.41-2+deb7u2"
						}
					]
				}
			],
			"versions": [
				"3.2.41-2",
				"3.2.41-2+deb7u1",
				"3.2.41-2+deb7u2~bpo60+1"
			],
			"database_specific": {
				"source": "https://storage.googleapis.com/debian-osv/dsa-osv/DSA-2669-1.json"
			}
		}
	],
	"references": [
		{
			"type": "ADVISORY",
			"url": "https://www.debian.org/security/2013/dsa-2669"
		}
	]
}
