{
	"schema_version": "1.6.0",
	"id": "DSA-2643-1",
	"modified": "2023-10-16T00:11:22.942097Z",
	"published": "2013-03-12T00:00:00Z",
	"related": [
		"CVE-2013-1640",
		"CVE-2013-1652",
		"CVE-2013-1653",
		"CVE-2013-1654",
		"CVE-2013-1655",
		"CVE-2013-2274",
		"CVE-2013-2275"
	],
	"summary": "puppet - several issues",
	"details": "\nMultiple vulnerabilities were discovered in Puppet, a centralized\nconfiguration management system.\n\n\n* [CVE-2013-1640](https://security-tracker.debian.org/tracker/CVE-2013-1640)\nAn authenticated malicious client may request its catalog from the puppet\n master, and cause the puppet master to execute arbitrary code. The puppet\n master must be made to invoke the template or inline\\_template\n functions during catalog compilation.\n* [CVE-2013-1652](https://security-tracker.debian.org/tracker/CVE-2013-1652)\nAn authenticated malicious client may retrieve catalogs from the puppet\n master that it is not authorized to access. Given a valid certificate and\n private key, it is possible to construct an HTTP GET request that will\n return a catalog for an arbitrary client.\n* [CVE-2013-1653](https://security-tracker.debian.org/tracker/CVE-2013-1653)\nAn authenticated malicious client may execute arbitrary code on Puppet\n agents that accept kick connections. Puppet agents are not vulnerable in\n their default configuration. However, if the Puppet agent is configured to\n listen for incoming connections, e.g. listen = true, and the agent's\n auth.conf allows access to the run REST endpoint, then an authenticated\n client can construct an HTTP PUT request to execute arbitrary code on the\n agent. This issue is made worse by the fact that puppet agents typically\n run as root.\n* [CVE-2013-1654](https://security-tracker.debian.org/tracker/CVE-2013-1654)\nA bug in Puppet allows SSL connections to be downgraded to SSLv2, which is\n known to contain design flaw weaknesses. This affects SSL connections\n between puppet agents and master, as well as connections that puppet agents\n make to third party servers that accept SSLv2 connections. Note that SSLv2\n is disabled since OpenSSL 1.0.\n* [CVE-2013-1655](https://security-tracker.debian.org/tracker/CVE-2013-1655)\nAn unauthenticated malicious client may send requests to the puppet master,\n and have the master load code in an unsafe manner. It only affects users\n whose puppet masters are running ruby 1.9.3 and above.\n* [CVE-2013-2274](https://security-tracker.debian.org/tracker/CVE-2013-2274)\nAn authenticated malicious client may execute arbitrary code on the\n puppet master in its default configuration. Given a valid certificate and\n private key, a client can construct an HTTP PUT request that is authorized\n to save the client's own report, but the request will actually cause the\n puppet master to execute arbitrary code.\n* [CVE-2013-2275](https://security-tracker.debian.org/tracker/CVE-2013-2275)\nThe default auth.conf allows an authenticated node to submit a report for\n any other node, which is a problem for compliance. It has been made more\n restrictive by default so that a node is only allowed to save its own\n report.\n\n\nFor the stable distribution (squeeze), these problems have been fixed in\nversion 2.6.2-5+squeeze7.\n\n\nFor the testing distribution (wheezy), these problems have been fixed in\nversion 2.7.18-3.\n\n\nFor the unstable distribution (sid), these problems have been fixed in\nversion 2.7.18-3.\n\n\nWe recommend that you upgrade your puppet packages.\n\n\n",
	"affected": [
		{
			"package": {
				"ecosystem": "Debian:6.0",
				"name": "puppet",
				"purl": "pkg:deb/debian/puppet?arch=source"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "2.6.2-5+squeeze7"
						}
					]
				}
			],
			"versions": [
				"2.6.2-4",
				"2.6.2-5",
				"2.6.2-5+squeeze1",
				"2.6.2-5+squeeze3",
				"2.6.2-5+squeeze4",
				"2.6.2-5+squeeze5",
				"2.6.2-5+squeeze6"
			],
			"database_specific": {
				"source": "https://storage.googleapis.com/debian-osv/dsa-osv/DSA-2643-1.json"
			}
		}
	],
	"references": [
		{
			"type": "ADVISORY",
			"url": "https://www.debian.org/security/2013/dsa-2643"
		}
	]
}
