{
	"schema_version": "1.6.0",
	"id": "DLA-491-1",
	"modified": "2023-06-28T06:27:02.723062Z",
	"published": "2016-05-27T00:00:00Z",
	"summary": "postgresql-9.1 - bugfix update",
	"details": "\nThe PostgreSQL project released a new version of the PostgreSQL 9.1 branch:\n\n\n* Clear the OpenSSL error queue before OpenSSL calls, rather than assuming it's\nclear already; and make sure we leave it clear afterwards (Peter Geoghegan,\nDave Vitek, Peter Eisentraut)\n\n\nThis change prevents problems when there are multiple connections using OpenSSL\nwithin a single process and not all the code involved follows the same rules\nfor when to clear the error queue. Failures have been reported specifically\nwhen a client application uses SSL connections in libpq concurrently with SSL\nconnections using the PHP, Python, or Ruby wrappers for OpenSSL. It's possible\nfor similar problems to arise within the server as well, if an extension module\nestablishes an outgoing SSL connection.\n\n\n* Fix \"failed to build any N-way joins\" planner error with a full join enclosed\nin the right-hand side of a left join (Tom Lane)\n* Fix possible misbehavior of TH, th, and Y,YYY format codes in to\\_timestamp()\n(Tom Lane)\n\n\nThese could advance off the end of the input string, causing subsequent format\ncodes to read garbage.\n\n\n* Fix dumping of rules and views in which the array argument of a value\noperator ANY (array) construct is a sub-SELECT (Tom Lane)\n* Make pg\\_regress use a startup timeout from the PGCTLTIMEOUT environment\nvariable, if that's set (Tom Lane)\n\n\nThis is for consistency with a behavior recently added to pg\\_ctl; it eases\nautomated testing on slow machines.\n\n\n* Fix pg\\_upgrade to correctly restore extension membership for operator\nfamilies containing only one operator class (Tom Lane)\n\n\nIn such a case, the operator family was restored into the new database, but it\nwas no longer marked as part of the extension. This had no immediate ill\neffects, but would cause later pg\\_dump runs to emit output that would cause\n(harmless) errors on restore.\n\n\n* Rename internal function strtoi() to strtoint() to avoid conflict with a\nNetBSD library function (Thomas Munro)\n* Use the FORMAT\\_MESSAGE\\_IGNORE\\_INSERTS flag where appropriate. No live bug is\nknown to exist here, but it seems like a good idea to be careful.\n\n\nFor Debian 7 Wheezy, these problems have been fixed in version\n9.1.22-0+deb7u1.\n\n\nWe recommend that you upgrade your postgresql-9.1 packages.\n\n\nFurther information about Debian LTS security advisories, how to apply\nthese updates to your system and frequently asked questions can be\nfound at: <https://wiki.debian.org/LTS>\n\n\n",
	"affected": [
		{
			"package": {
				"ecosystem": "Debian:7",
				"name": "postgresql-9.1",
				"purl": "pkg:deb/debian/postgresql-9.1?arch=source"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "9.1.22-0+deb7u1"
						}
					]
				}
			],
			"versions": [
				"9.1.10-0wheezy1",
				"9.1.10-1",
				"9.1.11-0wheezy1",
				"9.1.11-1",
				"9.1.11-1~bpo60+1",
				"9.1.11-2",
				"9.1.12-0wheezy1",
				"9.1.12-0wheezy1~bpo60+1",
				"9.1.12-1",
				"9.1.13-0wheezy1",
				"9.1.13-0wheezy1~bpo60+1",
				"9.1.13-1",
				"9.1.14-0+deb7u1",
				"9.1.14-0wheezy1",
				"9.1.15-0+deb7u1",
				"9.1.15-0+deb7u1~bpo60+1",
				"9.1.16-0+deb7u1",
				"9.1.16-0+deb7u2",
				"9.1.17-0+deb7u1",
				"9.1.18-0+deb7u1",
				"9.1.19-0+deb7u1",
				"9.1.20-0+deb7u1",
				"9.1.21-0+deb7u1",
				"9.1.9-1",
				"9.1.9-2",
				"9.1.9-3",
				"9.1.9-4",
				"9.1.9-5"
			],
			"database_specific": {
				"source": "https://storage.googleapis.com/debian-osv/dla-osv/DLA-491-1.json"
			}
		}
	],
	"references": [
		{
			"type": "ADVISORY",
			"url": "https://www.debian.org/lts/security/2016/dla-491"
		}
	]
}
