{
	"schema_version": "1.6.0",
	"id": "DLA-489-1",
	"modified": "2023-06-28T06:21:34.908070Z",
	"published": "2016-05-25T00:00:00Z",
	"related": [
		"CVE-2015-9097"
	],
	"summary": "ruby-mail - security update",
	"details": "\nThis security update fixes a security issue in\nruby-mail. We recommend you upgrade your ruby-mail package.\n\n\nTakeshi Terada (Mitsui Bussan Secure Directions, Inc.) released a\n whitepaper entitled SMTP Injection via recipient email addresses \n (<http://www.mbsd.jp/Whitepaper/smtpi.pdf>). \n This whitepaper has a section\n discussing how one such vulnerability affected the mail ruby gem (see\n section 3.1).\n\n\nWhitepaper has all the specific details, but basically the mail ruby gem\n module is prone to the recipient attack as it does not validate nor\n sanitize given recipient addresses. Thus, the attacks described in chapter\n 2 of the whitepaper can be applied to the gem without any modification. The\n mail ruby gem itself does not impose a length limit on email addresses,\n so an attacker can send a long spam message via a recipient address unless\n there is a limit on the application's side. This vulnerability affects only\n the applications that lack input validation.\n\n\nFor Debian 7 Wheezy, these problems have been fixed in version\n2.4.4-2+deb7u1.\n\n\nFurther information about Debian LTS security Advisories, how to apply\nthese updates to your system and frequently asked questions can be\nfound at: <https://wiki.debian.org/LTS>\n\n\n",
	"affected": [
		{
			"package": {
				"ecosystem": "Debian:7",
				"name": "ruby-mail",
				"purl": "pkg:deb/debian/ruby-mail?arch=source"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "2.4.4-2+deb7u1"
						}
					]
				}
			],
			"versions": [
				"2.4.4-2"
			],
			"database_specific": {
				"source": "https://storage.googleapis.com/debian-osv/dla-osv/DLA-489-1.json"
			}
		}
	],
	"references": [
		{
			"type": "ADVISORY",
			"url": "https://www.debian.org/lts/security/2016/dla-489"
		}
	]
}
