{
	"schema_version": "1.6.0",
	"id": "DSA-1627-2",
	"modified": "2023-10-16T00:05:33.995334Z",
	"published": "2008-08-04T00:00:00Z",
	"related": [
		"CVE-2008-2235",
		"CVE-2008-3972"
	],
	"summary": "opensc - smart card vulnerability",
	"details": "\nChaskiel M Grundman discovered that opensc, a library and utilities to\nhandle smart cards, would initialise smart cards with the Siemens CardOS M4\ncard operating system without proper access rights. This allowed everyone\nto change the card's PIN.\n\n\nWith this bug anyone can change a user PIN without having the PIN or PUK\nor the superusers PIN or PUK. However it can not be used to figure out the\nPIN. If the PIN on your card is still the same you always had, there's a\nreasonable chance that this vulnerability has not been exploited.\n\n\nThis vulnerability affects only smart cards and USB crypto tokens based on\nSiemens CardOS M4, and within that group only those that were initialised\nwith OpenSC. Users of other smart cards and USB crypto tokens, or cards\nthat have been initialised with some software other than OpenSC, are not\naffected.\n\n\nAfter upgrading the package, running\n`pkcs15-tool -T`\nwill show you whether the card is fine or vulnerable. If the card is\nvulnerable, you need to update the security setting using:\n`pkcs15-tool -T -U`.\n\n\nFor the stable distribution (etch), this problem has been fixed in\nversion 0.11.1-2etch2.\n\n\nFor the unstable distribution (sid), this problem has been fixed in\nversion 0.11.4-5.\n\n\nWe recommend that you upgrade your opensc package and check\nyour card(s) with the command described above.\n\n\n",
	"affected": [
		{
			"package": {
				"ecosystem": "Debian:4.0",
				"name": "opensc",
				"purl": "pkg:deb/debian/opensc?arch=source"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "0.11.1-2etch2"
						}
					]
				}
			],
			"versions": [
				"0.11.1-2",
				"0.11.1-2etch1"
			],
			"database_specific": {
				"source": "https://storage.googleapis.com/debian-osv/dsa-osv/DSA-1627-2.json"
			}
		}
	],
	"references": [
		{
			"type": "ADVISORY",
			"url": "https://www.debian.org/security/2008/dsa-1627"
		}
	]
}
