{
	"schema_version": "1.6.0",
	"id": "DSA-1571-1",
	"modified": "2023-10-16T00:10:30.796510Z",
	"published": "2008-05-13T00:00:00Z",
	"related": [
		"CVE-2007-3108",
		"CVE-2007-4995",
		"CVE-2008-0166"
	],
	"summary": "openssl - predictable random number generator",
	"details": "\nLuciano Bello discovered that the random number generator in Debian's\nopenssl package is predictable. This is caused by an incorrect\nDebian-specific change to the openssl package ([CVE-2008-0166](https://security-tracker.debian.org/tracker/CVE-2008-0166)). As a\nresult, cryptographic key material may be guessable.\n\n\nThis is a Debian-specific vulnerability which does not affect other\noperating systems which are not based on Debian. However, other systems\ncan be indirectly affected if weak keys are imported into them.\n\n\nIt is strongly recommended that all cryptographic key material which has\nbeen generated by OpenSSL versions starting with 0.9.8c-1 on Debian\nsystems is recreated from scratch. Furthermore, all DSA keys ever used\non affected Debian systems for signing or authentication purposes should\nbe considered compromised; the Digital Signature Algorithm relies on a\nsecret random value used during signature generation.\n\n\nThe first vulnerable version, 0.9.8c-1, was uploaded to the unstable\ndistribution on 2006-09-17, and has since that date propagated to the testing and\ncurrent stable (etch) distributions. The old stable distribution\n(sarge) is not affected.\n\n\nAffected keys include SSH keys, OpenVPN keys, DNSSEC keys, and key\nmaterial for use in X.509 certificates and session keys used in SSL/TLS\nconnections. Keys generated with GnuPG or GNUTLS are not affected,\nthough.\n\n\nA detector for known weak key material will be published at:\n\n\n\n[(OpenPGP signature)](http://security.debian.org/project/extra/dowkd/dowkd.pl.gz.asc)\n\n\nInstructions how to implement key rollover for various packages will be\npublished at:\n\n\n[https://www.debian.org/security/key-rollover/]($(HOME)/security/key-rollover/)\n\n\nThis web site will be continuously updated to reflect new and updated\ninstructions on key rollovers for packages using SSL certificates.\nPopular packages not affected will also be listed.\n\n\nIn addition to this critical change, two other vulnerabilities have been\nfixed in the openssl package which were originally scheduled for release\nwith the next etch point release: OpenSSL's DTLS (Datagram TLS,\nbasically SSL over UDP) implementation did not actually implement the\nDTLS specification, but a potentially much weaker protocol, and\ncontained a vulnerability permitting arbitrary code execution\n([CVE-2007-4995](https://security-tracker.debian.org/tracker/CVE-2007-4995)). A side channel attack in the integer multiplication\nroutines is also addressed ([CVE-2007-3108](https://security-tracker.debian.org/tracker/CVE-2007-3108)).\n\n\nFor the stable distribution (etch), these problems have been fixed in\nversion 0.9.8c-4etch3.\n\n\nFor the unstable distribution (sid) and the testing distribution\n(lenny), these problems have been fixed in version 0.9.8g-9.\n\n\nWe recommend that you upgrade your openssl package and subsequently\nregenerate any cryptographic material, as outlined above.\n\n\n",
	"affected": [
		{
			"package": {
				"ecosystem": "Debian:4.0",
				"name": "openssl",
				"purl": "pkg:deb/debian/openssl?arch=source"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "0.9.8c-4etch3"
						}
					]
				}
			],
			"versions": [
				"0.9.8c-4",
				"0.9.8c-4etch1",
				"0.9.8c-4etch2"
			],
			"database_specific": {
				"source": "https://storage.googleapis.com/debian-osv/dsa-osv/DSA-1571-1.json"
			}
		}
	],
	"references": [
		{
			"type": "ADVISORY",
			"url": "https://www.debian.org/security/2008/dsa-1571"
		}
	]
}
