{
	"schema_version": "1.6.0",
	"id": "DLA-2924-1",
	"modified": "2023-06-28T06:21:24.940592Z",
	"published": "2022-02-15T00:00:00Z",
	"related": [
		"CVE-2021-43859"
	],
	"summary": "libxstream-java - security update",
	"details": "\nIt was discovered that there was a potential remote denial of service (DoS)\nattack in XStream, a Java library used to serialize objects to XML and back\nagain.\n\n\nAn attacker could have consumed 100% of the CPU resources, but the library\nnow monitors and accumulates the time it takes to add elements to collections,\nand throws an exception if a set threshold is exceeded.\n\n\n* [CVE-2021-43859](https://security-tracker.debian.org/tracker/CVE-2021-43859)\nXStream is an open source java library to serialize objects to XML and\n back again. Versions prior to 1.4.19 may allow a remote attacker to\n allocate 100% CPU time on the target system depending on CPU type or\n parallel execution of such a payload resulting in a denial of service only\n by manipulating the processed input stream. XStream 1.4.19 monitors and\n accumulates the time it takes to add elements to collections and throws an\n exception if a set threshold is exceeded. Users are advised to upgrade as\n soon as possible. Users unable to upgrade may set the NO\\_REFERENCE mode to\n prevent recursion. See GHSA-rmr5-cpv2-vgjf for further details on a\n workaround if an upgrade is not possible.\n\n\nFor Debian 9 Stretch, these problems have been fixed in version\n1.4.11.1-1+deb9u5.\n\n\nWe recommend that you upgrade your libxstream-java packages.\n\n\nFurther information about Debian LTS security advisories, how to apply\nthese updates to your system and frequently asked questions can be\nfound at: <https://wiki.debian.org/LTS>\n\n\n",
	"affected": [
		{
			"package": {
				"ecosystem": "Debian:9",
				"name": "libxstream-java",
				"purl": "pkg:deb/debian/libxstream-java?arch=source"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "1.4.11.1-1+deb9u5"
						}
					]
				}
			],
			"versions": [
				"1.4.10-1",
				"1.4.11-1",
				"1.4.11.1-1",
				"1.4.11.1-1+deb9u1",
				"1.4.11.1-1+deb9u2",
				"1.4.11.1-1+deb9u3",
				"1.4.11.1-1+deb9u4",
				"1.4.9-2",
				"1.4.9-2+deb9u1"
			],
			"database_specific": {
				"source": "https://storage.googleapis.com/debian-osv/dla-osv/DLA-2924-1.json"
			}
		}
	],
	"references": [
		{
			"type": "ADVISORY",
			"url": "https://www.debian.org/lts/security/2022/dla-2924"
		}
	]
}
