{
	"schema_version": "1.6.0",
	"id": "DLA-3244-1",
	"modified": "2023-06-28T06:25:29.567458Z",
	"published": "2022-12-22T00:00:00Z",
	"related": [
		"CVE-2021-3759",
		"CVE-2022-3169",
		"CVE-2022-3435",
		"CVE-2022-3521",
		"CVE-2022-3524",
		"CVE-2022-3564",
		"CVE-2022-3565",
		"CVE-2022-3594",
		"CVE-2022-3628",
		"CVE-2022-3640",
		"CVE-2022-3643",
		"CVE-2022-4139",
		"CVE-2022-41849",
		"CVE-2022-41850",
		"CVE-2022-42328",
		"CVE-2022-42329",
		"CVE-2022-42895",
		"CVE-2022-42896",
		"CVE-2022-4378",
		"CVE-2022-47518",
		"CVE-2022-47519",
		"CVE-2022-47520",
		"CVE-2022-47521"
	],
	"summary": "linux-5.10 - security update",
	"details": "\nSeveral vulnerabilities have been discovered in the Linux kernel that\nmay lead to a privilege escalation, denial of service or information\nleaks.\n\n\n* [CVE-2021-3759](https://security-tracker.debian.org/tracker/CVE-2021-3759)\nIt was discovered that the memory cgroup controller did not\n account for kernel memory allocated for IPC objects. A local user\n could use this for denial of service (memory exhaustion).\n* [CVE-2022-3169](https://security-tracker.debian.org/tracker/CVE-2022-3169)\nIt was discovered that the NVMe host driver did not prevent a\n concurrent reset and subsystem reset. A local user with access to\n an NVMe device could use this to cause a denial of service (device\n disconnect or crash).\n* [CVE-2022-3435](https://security-tracker.debian.org/tracker/CVE-2022-3435)\nGwangun Jung reported a flaw in the IPv4 forwarding subsystem\n which would lead to an out-of-bounds read. A local user with\n CAP\\_NET\\_ADMIN capability in any user namespace could possibly\n exploit this to cause a denial of service (crash).\n* [CVE-2022-3521](https://security-tracker.debian.org/tracker/CVE-2022-3521)\nThe syzbot tool found a race condition in the KCM subsystem\n which could lead to a crash.\n\n\nThis subsystem is not enabled in Debian's official kernel\n configurations.\n* [CVE-2022-3524](https://security-tracker.debian.org/tracker/CVE-2022-3524)\nThe syzbot tool found a race condition in the IPv6 stack which\n could lead to a memory leak. A local user could exploit this to\n cause a denial of service (memory exhaustion).\n* [CVE-2022-3564](https://security-tracker.debian.org/tracker/CVE-2022-3564)\nA flaw was discovered in the Bluetooh L2CAP subsystem which\n would lead to a use-after-free. This might be exploitable\n to cause a denial of service (crash or memory corruption) or\n possibly for privilege escalation.\n* [CVE-2022-3565](https://security-tracker.debian.org/tracker/CVE-2022-3565)\nA flaw was discovered in the mISDN driver which would lead to a\n use-after-free. This might be exploitable to cause a denial of\n service (crash or memory corruption) or possibly for privilege\n escalation.\n* [CVE-2022-3594](https://security-tracker.debian.org/tracker/CVE-2022-3594)\nAndrew Gaul reported that the r8152 Ethernet driver would log\n excessive numbers of messages in response to network errors. A\n remote attacker could possibly exploit this to cause a denial of\n service (resource exhaustion).\n* [CVE-2022-3628](https://security-tracker.debian.org/tracker/CVE-2022-3628)\nDokyung Song, Jisoo Jang, and Minsuk Kang reported a potential\n heap-based buffer overflow in the brcmfmac Wi-Fi driver. A user\n able to connect a malicious USB device could exploit this to cause\n a denial of service (crash or memory corruption) or possibly for\n privilege escalation.\n* [CVE-2022-3640](https://security-tracker.debian.org/tracker/CVE-2022-3640)\nA flaw was discovered in the Bluetooh L2CAP subsystem which\n would lead to a use-after-free. This might be exploitable\n to cause a denial of service (crash or memory corruption) or\n possibly for privilege escalation.\n* [CVE-2022-3643](https://security-tracker.debian.org/tracker/CVE-2022-3643) (XSA-423)\n\n A flaw was discovered in the Xen network backend driver that would\n result in it generating malformed packet buffers. If these\n packets were forwarded to certain other network devices, a Xen\n guest could exploit this to cause a denial of service (crash or\n device reset).\n* [CVE-2022-4139](https://security-tracker.debian.org/tracker/CVE-2022-4139)\nA flaw was discovered in the i915 graphics driver. On gen12 Xe\n GPUs it failed to flush TLBs when necessary, resulting in GPU\n programs retaining access to freed memory. A local user with\n access to the GPU could exploit this to leak sensitive\n information, cause a denial of service (crash or memory\n corruption) or likely for privilege escalation.\n* [CVE-2022-4378](https://security-tracker.debian.org/tracker/CVE-2022-4378)\nKyle Zeng found a flaw in procfs that would cause a stack-based\n buffer overflow. A local user permitted to write to a sysctl\n could use this to cause a denial of service (crash or memory\n corruption) or possibly for privilege escalation.\n* [CVE-2022-41849](https://security-tracker.debian.org/tracker/CVE-2022-41849)\nA race condition was discovered in the smscufx graphics driver,\n which could lead to a use-after-free. A user able to remove the\n physical device while also accessing its device node could exploit\n this to cause a denial of service (crash or memory corruption) or\n possibly for privilege escalation.\n* [CVE-2022-41850](https://security-tracker.debian.org/tracker/CVE-2022-41850)\nA race condition was discovered in the hid-roccat input driver,\n which could lead to a use-after-free. A local user able to access\n such a device could exploit this to cause a denial of service\n (crash or memory corruption) or possibly for privilege escalation.\n* [CVE-2022-42328](https://security-tracker.debian.org/tracker/CVE-2022-42328), [CVE-2022-42329](https://security-tracker.debian.org/tracker/CVE-2022-42329) (XSA-424)\n\n Yang Yingliang reported that the Xen network backend driver did\n not use the proper function to free packet buffers in one case,\n which could lead to a deadlock. A Xen guest could exploit this to\n cause a denial of service (hang).\n* [CVE-2022-42895](https://security-tracker.debian.org/tracker/CVE-2022-42895)\nTam훯훲s Koczka reported a flaw in the Bluetooh L2CAP subsystem\n that would result in reading uninitialised memory. A nearby\n attacker able to make a Bluetooth connection could exploit\n this to leak sensitive information.\n* [CVE-2022-42896](https://security-tracker.debian.org/tracker/CVE-2022-42896)\nTam훯훲s Koczka reported flaws in the Bluetooh L2CAP subsystem that\n can lead to a use-after-free. A nearby attacker able to make a\n Bluetooth SMP connection could exploit this to cause a denial of\n service (crash or memory corruption) or possibly for remote code\n execution.\n* [CVE-2022-47518](https://security-tracker.debian.org/tracker/CVE-2022-47518), [CVE-2022-47519](https://security-tracker.debian.org/tracker/CVE-2022-47519), [CVE-2022-47521](https://security-tracker.debian.org/tracker/CVE-2022-47521)\nSeveral flaws were discovered in the wilc1000 Wi-Fi driver which\n could lead to a heap-based buffer overflow. A nearby attacker\n could exploit these for denial of service (crash or memory\n corruption) or possibly for remote code execution.\n* [CVE-2022-47520](https://security-tracker.debian.org/tracker/CVE-2022-47520)\nA flaw was discovered in the wilc1000 Wi-Fi driver which could\n lead to a heap-based buffer overflow. A local user with\n CAP\\_NET\\_ADMIN capability over such a Wi-Fi device could exploit\n this for denial of service (crash or memory corruption) or\n possibly for privilege escalation.\n\n\nFor Debian 10 buster, these problems have been fixed in version\n5.10.158-2~deb10u1.\n\n\nWe recommend that you upgrade your linux-5.10 packages.\n\n\nFor the detailed security status of linux-5.10 please refer to\nits security tracker page at:\n<https://security-tracker.debian.org/tracker/linux-5.10>\n\n\nFurther information about Debian LTS security advisories, how to apply\nthese updates to your system and frequently asked questions can be\nfound at: <https://wiki.debian.org/LTS>\n\n\n",
	"affected": [
		{
			"package": {
				"ecosystem": "Debian:10",
				"name": "linux-5.10",
				"purl": "pkg:deb/debian/linux-5.10?arch=source"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "5.10.158-2~deb10u1"
						}
					]
				}
			],
			"versions": [
				"5.10.136-1~deb10u1",
				"5.10.136-1~deb10u2",
				"5.10.136-1~deb10u3",
				"5.10.149-2~deb10u1"
			],
			"database_specific": {
				"source": "https://storage.googleapis.com/debian-osv/dla-osv/DLA-3244-1.json"
			}
		}
	],
	"references": [
		{
			"type": "ADVISORY",
			"url": "https://www.debian.org/lts/security/2022/dla-3244"
		}
	]
}
