{
	"schema_version": "1.6.0",
	"id": "DLA-3203-1",
	"modified": "2023-06-28T06:21:27.262766Z",
	"published": "2022-11-23T00:00:00Z",
	"related": [
		"CVE-2021-3618",
		"CVE-2022-41741",
		"CVE-2022-41742"
	],
	"summary": "nginx - security update",
	"details": "\nIt was discovered that parsing errors in the mp4 module of Nginx, a\nhigh-performance web and reverse proxy server, could result in denial\nof service, memory disclosure or potentially the execution of arbitrary\ncode when processing a malformed mp4 file.\n\n\nThis module is only enabled in the nginx-extras binary package.\n\n\nIn addition the following vulnerability has been fixed.\n\n\n* [CVE-2021-3618](https://security-tracker.debian.org/tracker/CVE-2021-3618)\nALPACA is an application layer protocol content confusion attack,\n exploiting TLS servers implementing different protocols but using\n compatible certificates, such as multi-domain or wildcard certificates.\n A MiTM attacker having access to victim's traffic at the TCP/IP layer can\n redirect traffic from one subdomain to another, resulting in a valid TLS\n session. This breaks the authentication of TLS and cross-protocol attacks\n may be possible where the behavior of one protocol service may compromise\n\n\nFor Debian 10 buster, these problems have been fixed in version\n1.14.2-2+deb10u5.\n\n\nWe recommend that you upgrade your nginx packages.\n\n\nFor the detailed security status of nginx please refer to\nits security tracker page at:\n<https://security-tracker.debian.org/tracker/nginx>\n\n\nFurther information about Debian LTS security advisories, how to apply\nthese updates to your system and frequently asked questions can be\nfound at: <https://wiki.debian.org/LTS>\n\n\n",
	"affected": [
		{
			"package": {
				"ecosystem": "Debian:10",
				"name": "nginx",
				"purl": "pkg:deb/debian/nginx?arch=source"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "1.14.2-2+deb10u5"
						}
					]
				}
			],
			"versions": [
				"1.14.2-2",
				"1.14.2-2+deb10u1",
				"1.14.2-2+deb10u2",
				"1.14.2-2+deb10u3",
				"1.14.2-2+deb10u4"
			],
			"database_specific": {
				"source": "https://storage.googleapis.com/debian-osv/dla-osv/DLA-3203-1.json"
			}
		}
	],
	"references": [
		{
			"type": "ADVISORY",
			"url": "https://www.debian.org/lts/security/2022/dla-3203"
		}
	]
}
