{
	"schema_version": "1.6.0",
	"id": "DLA-1885-1",
	"modified": "2023-06-28T06:29:53.774181Z",
	"published": "2019-08-14T00:00:00Z",
	"related": [
		"CVE-2017-18509",
		"CVE-2018-20836",
		"CVE-2018-20856",
		"CVE-2018-5995",
		"CVE-2019-10207",
		"CVE-2019-10638",
		"CVE-2019-10639",
		"CVE-2019-1125",
		"CVE-2019-13631",
		"CVE-2019-13648",
		"CVE-2019-14283",
		"CVE-2019-14284",
		"CVE-2019-3882",
		"CVE-2019-3900"
	],
	"summary": "linux-4.9 - security update",
	"details": "\nSeveral vulnerabilities have been discovered in the Linux kernel that\nmay lead to a privilege escalation, denial of service or information\nleaks.\n\n\n* [CVE-2017-18509](https://security-tracker.debian.org/tracker/CVE-2017-18509)\nDenis Andzakovic reported a missing type check in the IPv4 multicast\n routing implementation. A user with the CAP\\_NET\\_ADMIN capability (in\n any user namespace) could use this for denial-of-service (memory\n corruption or crash) or possibly for privilege escalation.\n* [CVE-2018-5995](https://security-tracker.debian.org/tracker/CVE-2018-5995)\nADLab of VenusTech discovered that the kernel logged the virtual\n addresses assigned to per-CPU data, which could make it easier to\n exploit other vulnerabilities.\n* [CVE-2018-20836](https://security-tracker.debian.org/tracker/CVE-2018-20836)\nchenxiang reported a race condition in libsas, the kernel\n subsystem supporting Serial Attached SCSI (SAS) devices, which\n could lead to a use-after-free. It is not clear how this might be\n exploited.\n* [CVE-2018-20856](https://security-tracker.debian.org/tracker/CVE-2018-20856)\nXiao Jin reported a potential double-free in the block subsystem,\n in case an error occurs while initialising the I/O scheduler for a\n block device. It is not clear how this might be exploited.\n* [CVE-2019-1125](https://security-tracker.debian.org/tracker/CVE-2019-1125)\nIt was discovered that most x86 processors could speculatively\n skip a conditional SWAPGS instruction used when entering the\n kernel from user mode, and/or could speculatively execute it when\n it should be skipped. This is a subtype of Spectre variant 1,\n which could allow local users to obtain sensitive information from\n the kernel or other processes. It has been mitigated by using\n memory barriers to limit speculative execution. Systems using an\n i386 kernel are not affected as the kernel does not use SWAPGS.\n* [CVE-2019-3882](https://security-tracker.debian.org/tracker/CVE-2019-3882)\nIt was found that the vfio implementation did not limit the number\n of DMA mappings to device memory. A local user granted ownership\n of a vfio device could use this to cause a denial of service\n (out-of-memory condition).\n* [CVE-2019-3900](https://security-tracker.debian.org/tracker/CVE-2019-3900)\nIt was discovered that vhost drivers did not properly control the\n amount of work done to service requests from guest VMs. A\n malicious guest could use this to cause a denial-of-service\n (unbounded CPU usage) on the host.\n* [CVE-2019-10207](https://security-tracker.debian.org/tracker/CVE-2019-10207)\nThe syzkaller tool found a potential null dereference in various\n drivers for UART-attached Bluetooth adapters. A local user with\n access to a pty device or other suitable tty device could use this\n for denial-of-service (BUG/oops).\n* [CVE-2019-10638](https://security-tracker.debian.org/tracker/CVE-2019-10638)\nAmit Klein and Benny Pinkas discovered that the generation of IP\n packet IDs used a weak hash function, jhash. This could enable\n tracking individual computers as they communicate with different\n remote servers and from different networks. The siphash\n function is now used instead.\n* [CVE-2019-10639](https://security-tracker.debian.org/tracker/CVE-2019-10639)\nAmit Klein and Benny Pinkas discovered that the generation of IP\n packet IDs used a weak hash function that incorporated a kernel\n virtual address. This hash function is no longer used for IP IDs,\n although it is still used for other purposes in the network stack.\n* [CVE-2019-13631](https://security-tracker.debian.org/tracker/CVE-2019-13631)\nIt was discovered that the gtco driver for USB input tablets could\n overrun a stack buffer with constant data while parsing the device's\n descriptor. A physically present user with a specially\n constructed USB device could use this to cause a denial-of-service\n (BUG/oops), or possibly for privilege escalation.\n* [CVE-2019-13648](https://security-tracker.debian.org/tracker/CVE-2019-13648)\nPraveen Pandey reported that on PowerPC (ppc64el) systems without\n Transactional Memory (TM), the kernel would still attempt to\n restore TM state passed to the sigreturn() system call. A local\n user could use this for denial-of-service (oops).\n* [CVE-2019-14283](https://security-tracker.debian.org/tracker/CVE-2019-14283)\nThe syzkaller tool found a missing bounds check in the floppy disk\n driver. A local user with access to a floppy disk device, with a\n disk present, could use this to read kernel memory beyond the\n I/O buffer, possibly obtaining sensitive information.\n* [CVE-2019-14284](https://security-tracker.debian.org/tracker/CVE-2019-14284)\nThe syzkaller tool found a potential division-by-zero in the\n floppy disk driver. A local user with access to a floppy disk\n device could use this for denial-of-service (oops).\n* [(CVE ID not yet assigned)](https://pulsesecurity.co.nz/advisories/linux-kernel-4.9-tcpsocketsuaf)\nDenis Andzakovic reported a possible use-after-free in the\n TCP sockets implementation. A local user could use this for\n denial-of-service (memory corruption or crash) or possibly\n for privilege escalation.\n* (CVE ID not yet assigned)\n\n The netfilter conntrack subsystem used kernel addresses as\n user-visible IDs, which could make it easier to exploit other\n security vulnerabilities.\n* [XSA-300](https://xenbits.xen.org/xsa/advisory-300.html)\nJulien Grall reported that Linux does not limit the amount of memory\n which a domain will attempt to baloon out, nor limits the amount of\n \"foreign / grant map\" memory which any individual guest can consume,\n leading to denial of service conditions (for host or guests).\n\n\nFor Debian 8 Jessie, these problems have been fixed in version\n4.9.168-1+deb9u5~deb8u1.\n\n\nWe recommend that you upgrade your linux-4.9 packages.\n\n\nFurther information about Debian LTS security advisories, how to apply\nthese updates to your system and frequently asked questions can be\nfound at: <https://wiki.debian.org/LTS>\n\n\n",
	"affected": [
		{
			"package": {
				"ecosystem": "Debian:8",
				"name": "linux-4.9",
				"purl": "pkg:deb/debian/linux-4.9?arch=source"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "4.9.168-1+deb9u5~deb8u1"
						}
					]
				}
			],
			"versions": [
				"4.9.110-1~deb8u1",
				"4.9.144-3.1~deb8u1",
				"4.9.168-1~deb8u1"
			],
			"database_specific": {
				"source": "https://storage.googleapis.com/debian-osv/dla-osv/DLA-1885-1.json"
			}
		}
	],
	"references": [
		{
			"type": "ADVISORY",
			"url": "https://www.debian.org/lts/security/2019/dla-1885"
		}
	]
}
