{
	"schema_version": "1.6.0",
	"id": "DLA-1715-1",
	"modified": "2023-06-28T06:29:43.897595Z",
	"published": "2019-03-15T00:00:00Z",
	"related": [
		"CVE-2017-18249",
		"CVE-2018-1128",
		"CVE-2018-1129",
		"CVE-2018-12896",
		"CVE-2018-13053",
		"CVE-2018-13096",
		"CVE-2018-13097",
		"CVE-2018-13100",
		"CVE-2018-13406",
		"CVE-2018-14610",
		"CVE-2018-14611",
		"CVE-2018-14612",
		"CVE-2018-14613",
		"CVE-2018-14614",
		"CVE-2018-14616",
		"CVE-2018-15471",
		"CVE-2018-16862",
		"CVE-2018-17972",
		"CVE-2018-18021",
		"CVE-2018-18281",
		"CVE-2018-18690",
		"CVE-2018-18710",
		"CVE-2018-19407",
		"CVE-2018-3639",
		"CVE-2018-5391",
		"CVE-2018-5848",
		"CVE-2018-6554"
	],
	"summary": "linux-4.9 - security update",
	"details": "\nSeveral vulnerabilities have been discovered in the Linux kernel that\nmay lead to a privilege escalation, denial of service or information\nleaks.\n\n\n* [CVE-2017-18249](https://security-tracker.debian.org/tracker/CVE-2017-18249)\nA race condition was discovered in the disk space allocator of\n F2FS. A user with access to an F2FS volume could use this to cause\n a denial of service or other security impact.\n* [CVE-2018-1128](https://security-tracker.debian.org/tracker/CVE-2018-1128), [CVE-2018-1129](https://security-tracker.debian.org/tracker/CVE-2018-1129)\nThe cephx authentication protocol used by Ceph was susceptible to\n replay attacks, and calculated signatures incorrectly. These\n vulnerabilities in the server required changes to authentication\n that are incompatible with existing clients. The kernel's client\n code has now been updated to be compatible with the fixed server.\n* [CVE-2018-3639](https://security-tracker.debian.org/tracker/CVE-2018-3639) (SSB)\n\n Multiple researchers have discovered that Speculative Store Bypass\n (SSB), a feature implemented in many processors, could be used to\n read sensitive information from another context. In particular,\n code in a software sandbox may be able to read sensitive\n information from outside the sandbox. This issue is also known as\n Spectre variant 4.\n\n\nThis update adds a further mitigation for this issue in the eBPF\n (Extended Berkeley Packet Filter) implementation.\n* [CVE-2018-5391](https://security-tracker.debian.org/tracker/CVE-2018-5391) (FragmentSmack)\n\n Juha-Matti Tilli discovered a flaw in the way the Linux kernel\n handled reassembly of fragmented IPv4 and IPv6 packets. A remote\n attacker can take advantage of this flaw to trigger time and\n calculation expensive fragment reassembly algorithms by sending\n specially crafted packets, leading to remote denial of service.\n\n\nThis was previously mitigated by reducing the default limits on\n memory usage for incomplete fragmented packets. This update\n replaces that mitigation with a more complete fix.\n* [CVE-2018-5848](https://security-tracker.debian.org/tracker/CVE-2018-5848)\nThe wil6210 wifi driver did not properly validate lengths in scan\n and connection requests, leading to a possible buffer overflow.\n On systems using this driver, a local user with the CAP\\_NET\\_ADMIN\n capability could use this for denial of service (memory corruption\n or crash) or potentially for privilege escalation.\n* [CVE-2018-12896](https://security-tracker.debian.org/tracker/CVE-2018-12896), [CVE-2018-13053](https://security-tracker.debian.org/tracker/CVE-2018-13053)\nTeam OWL337 reported possible integer overflows in the POSIX\n timer implementation. These might have some security impact.\n* [CVE-2018-13096](https://security-tracker.debian.org/tracker/CVE-2018-13096), [CVE-2018-13097](https://security-tracker.debian.org/tracker/CVE-2018-13097), [CVE-2018-13100](https://security-tracker.debian.org/tracker/CVE-2018-13100), [CVE-2018-14614](https://security-tracker.debian.org/tracker/CVE-2018-14614), [CVE-2018-14616](https://security-tracker.debian.org/tracker/CVE-2018-14616)\nWen Xu from SSLab at Gatech reported that crafted F2FS volumes\n could trigger a crash (BUG, Oops, or division by zero) and/or\n out-of-bounds memory access. An attacker able to mount such a\n volume could use this to cause a denial of service or possibly for\n privilege escalation.\n* [CVE-2018-13406](https://security-tracker.debian.org/tracker/CVE-2018-13406)\nDr Silvio Cesare of InfoSect reported a potential integer overflow\n in the uvesafb driver. A user with permission to access such a\n device might be able to use this for denial of service or\n privilege escalation.\n* [CVE-2018-14610](https://security-tracker.debian.org/tracker/CVE-2018-14610), [CVE-2018-14611](https://security-tracker.debian.org/tracker/CVE-2018-14611), [CVE-2018-14612](https://security-tracker.debian.org/tracker/CVE-2018-14612), [CVE-2018-14613](https://security-tracker.debian.org/tracker/CVE-2018-14613)\nWen Xu from SSLab at Gatech reported that crafted Btrfs volumes\n could trigger a crash (Oops) and/or out-of-bounds memory access.\n An attacker able to mount such a volume could use this to cause a\n denial of service or possibly for privilege escalation.\n* [CVE-2018-15471](https://security-tracker.debian.org/tracker/CVE-2018-15471) (XSA-270)\n\n Felix Wilhelm of Google Project Zero discovered a flaw in the hash\n handling of the xen-netback Linux kernel module. A malicious or\n buggy frontend may cause the (usually privileged) backend to make\n out of bounds memory accesses, potentially resulting in privilege\n escalation, denial of service, or information leaks.\n\n\nhttps://xenbits.xen.org/xsa/advisory-270.html\n* [CVE-2018-16862](https://security-tracker.debian.org/tracker/CVE-2018-16862)\nVasily Averin and Pavel Tikhomirov from Virtuozzo Kernel Team\n discovered that the cleancache memory management feature did not\n invalidate cached data for deleted files. On Xen guests using the\n tmem driver, local users could potentially read data from other\n users' deleted files if they were able to create new files on the\n same volume.\n* [CVE-2018-17972](https://security-tracker.debian.org/tracker/CVE-2018-17972)\nJann Horn reported that the /proc/\\*/stack files in procfs leaked\n sensitive data from the kernel. These files are now only readable\n by users with the CAP\\_SYS\\_ADMIN capability (usually only root)\n* [CVE-2018-18281](https://security-tracker.debian.org/tracker/CVE-2018-18281)\nJann Horn reported a race condition in the virtual memory manager\n that can result in a process briefly having access to memory after\n it is freed and reallocated. A local user could possibly exploit\n this for denial of service (memory corruption) or for privilege\n escalation.\n* [CVE-2018-18690](https://security-tracker.debian.org/tracker/CVE-2018-18690)\nKanda Motohiro reported that XFS did not correctly handle some\n xattr (extended attribute) writes that require changing the disk\n format of the xattr. A user with access to an XFS volume could use\n this for denial of service.\n* [CVE-2018-18710](https://security-tracker.debian.org/tracker/CVE-2018-18710)\nIt was discovered that the cdrom driver does not correctly\n validate the parameter to the CDROM\\_SELECT\\_DISC ioctl. A user with\n access to a cdrom device could use this to read sensitive\n information from the kernel or to cause a denial of service\n (crash).\n* [CVE-2018-19407](https://security-tracker.debian.org/tracker/CVE-2018-19407)\nWei Wu reported a potential crash (Oops) in the KVM implementation\n for x86 processors. A user with access to /dev/kvm could use this\n for denial of service.\n\n\nFor Debian 8 Jessie, these problems have been fixed in version\n4.9.144-3.1~deb8u1. This version also includes fixes for Debian bugs\n#890034, #896911, #907581, #915229, and #915231; and other fixes\nincluded in upstream stable updates.\n\n\nWe recommend that you upgrade your linux-4.9 packages.\n\n\nFurther information about Debian LTS security advisories, how to apply\nthese updates to your system and frequently asked questions can be\nfound at: <https://wiki.debian.org/LTS>\n\n\n",
	"affected": [
		{
			"package": {
				"ecosystem": "Debian:8",
				"name": "linux-4.9",
				"purl": "pkg:deb/debian/linux-4.9?arch=source"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "4.9.144-3.1~deb8u1"
						}
					]
				}
			],
			"versions": [
				"4.9.110-1~deb8u1"
			],
			"database_specific": {
				"source": "https://storage.googleapis.com/debian-osv/dla-osv/DLA-1715-1.json"
			}
		}
	],
	"references": [
		{
			"type": "ADVISORY",
			"url": "https://www.debian.org/lts/security/2019/dla-1715"
		}
	]
}
