{
	"schema_version": "1.6.0",
	"id": "DLA-1891-1",
	"modified": "2023-06-28T06:29:55.404951Z",
	"published": "2019-08-19T00:00:00Z",
	"related": [
		"CVE-2019-13057",
		"CVE-2019-13565"
	],
	"summary": "openldap - security update",
	"details": "\nSeveral security vulnerabilities were discovered in openldap, a server\nand tools to provide a standalone directory service.\n\n\n* [CVE-2019-13057](https://security-tracker.debian.org/tracker/CVE-2019-13057)\nWhen the server administrator delegates rootDN (database admin)\n privileges for certain databases but wants to maintain isolation\n (e.g., for multi-tenant deployments), slapd does not properly stop a\n rootDN from requesting authorization as an identity from another\n database during a SASL bind or with a proxyAuthz (RFC 4370) control.\n (It is not a common configuration to deploy a system where the\n server administrator and a DB administrator enjoy different levels\n of trust.)\n* [CVE-2019-13565](https://security-tracker.debian.org/tracker/CVE-2019-13565)\nWhen using SASL authentication and session encryption, and relying\n on the SASL security layers in slapd access controls, it is possible\n to obtain access that would otherwise be denied via a simple bind\n for any identity covered in those ACLs. After the first SASL bind is\n completed, the sasl\\_ssf value is retained for all new non-SASL\n connections. Depending on the ACL configuration, this can affect\n different types of operations (searches, modifications, etc.). In\n other words, a successful authorization step completed by one user\n affects the authorization requirement for a different user.\n\n\nFor Debian 8 Jessie, these problems have been fixed in version\n2.4.40+dfsg-1+deb8u5.\n\n\nWe recommend that you upgrade your openldap packages.\n\n\nFurther information about Debian LTS security advisories, how to apply\nthese updates to your system and frequently asked questions can be\nfound at: <https://wiki.debian.org/LTS>\n\n\n",
	"affected": [
		{
			"package": {
				"ecosystem": "Debian:8",
				"name": "openldap",
				"purl": "pkg:deb/debian/openldap?arch=source"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "2.4.40+dfsg-1+deb8u5"
						}
					]
				}
			],
			"versions": [
				"2.4.40+dfsg-1",
				"2.4.40+dfsg-1+deb8u1",
				"2.4.40+dfsg-1+deb8u2",
				"2.4.40+dfsg-1+deb8u3",
				"2.4.40+dfsg-1+deb8u4"
			],
			"database_specific": {
				"source": "https://storage.googleapis.com/debian-osv/dla-osv/DLA-1891-1.json"
			}
		}
	],
	"references": [
		{
			"type": "ADVISORY",
			"url": "https://www.debian.org/lts/security/2019/dla-1891"
		}
	]
}
