{
	"schema_version": "1.6.0",
	"id": "DSA-4073-1",
	"modified": "2023-10-16T00:12:37.826097Z",
	"published": "2017-12-23T00:00:00Z",
	"related": [
		"CVE-2017-1000407",
		"CVE-2017-1000410",
		"CVE-2017-16538",
		"CVE-2017-16644",
		"CVE-2017-16995",
		"CVE-2017-17448",
		"CVE-2017-17449",
		"CVE-2017-17450",
		"CVE-2017-17558",
		"CVE-2017-17712",
		"CVE-2017-17741",
		"CVE-2017-17805",
		"CVE-2017-17806",
		"CVE-2017-17807",
		"CVE-2017-17862",
		"CVE-2017-17863",
		"CVE-2017-17864",
		"CVE-2017-8824"
	],
	"summary": "linux - security update",
	"details": "\nSeveral vulnerabilities have been discovered in the Linux kernel that\nmay lead to a privilege escalation, denial of service or information\nleaks.\n\n\n* [CVE-2017-8824](https://security-tracker.debian.org/tracker/CVE-2017-8824)\nMohamed Ghannam discovered that the DCCP implementation did not\n correctly manage resources when a socket is disconnected and\n reconnected, potentially leading to a use-after-free. A local\n user could use this for denial of service (crash or data\n corruption) or possibly for privilege escalation. On systems that\n do not already have the dccp module loaded, this can be mitigated\n by disabling it:\n `echo >> /etc/modprobe.d/disable-dccp.conf install dccp false`\n* [CVE-2017-16538](https://security-tracker.debian.org/tracker/CVE-2017-16538)\nAndrey Konovalov reported that the dvb-usb-lmedm04 media driver\n did not correctly handle some error conditions during\n initialisation. A physically present user with a specially\n designed USB device can use this to cause a denial of service\n (crash).\n* [CVE-2017-16644](https://security-tracker.debian.org/tracker/CVE-2017-16644)\nAndrey Konovalov reported that the hdpvr media driver did not\n correctly handle some error conditions during initialisation. A\n physically present user with a specially designed USB device can\n use this to cause a denial of service (crash).\n* [CVE-2017-16995](https://security-tracker.debian.org/tracker/CVE-2017-16995)\nJann Horn discovered that the Extended BPF verifier did not\n correctly model the behaviour of 32-bit load instructions. A\n local user can use this for privilege escalation.\n* [CVE-2017-17448](https://security-tracker.debian.org/tracker/CVE-2017-17448)\nKevin Cernekee discovered that the netfilter subsystem allowed\n users with the CAP\\_NET\\_ADMIN capability in any user namespace, not\n just the root namespace, to enable and disable connection tracking\n helpers. This could lead to denial of service, violation of\n network security policy, or have other impact.\n* [CVE-2017-17449](https://security-tracker.debian.org/tracker/CVE-2017-17449)\nKevin Cernekee discovered that the netlink subsystem allowed\n users with the CAP\\_NET\\_ADMIN capability in any user namespace\n to monitor netlink traffic in all net namespaces, not just\n those owned by that user namespace. This could lead to\n exposure of sensitive information.\n* [CVE-2017-17450](https://security-tracker.debian.org/tracker/CVE-2017-17450)\nKevin Cernekee discovered that the xt\\_osf module allowed users\n with the CAP\\_NET\\_ADMIN capability in any user namespace to modify\n the global OS fingerprint list.\n* [CVE-2017-17558](https://security-tracker.debian.org/tracker/CVE-2017-17558)\nAndrey Konovalov reported that that USB core did not correctly\n handle some error conditions during initialisation. A physically\n present user with a specially designed USB device can use this to\n cause a denial of service (crash or memory corruption), or\n possibly for privilege escalation.\n* [CVE-2017-17712](https://security-tracker.debian.org/tracker/CVE-2017-17712)\nMohamed Ghannam discovered a race condition in the IPv4 raw socket\n implementation. A local user could use this to obtain sensitive\n information from the kernel.\n* [CVE-2017-17741](https://security-tracker.debian.org/tracker/CVE-2017-17741)\nDmitry Vyukov reported that the KVM implementation for x86 would\n over-read data from memory when emulating an MMIO write if the\n kvm\\_mmio tracepoint was enabled. A guest virtual machine might be\n able to use this to cause a denial of service (crash).\n* [CVE-2017-17805](https://security-tracker.debian.org/tracker/CVE-2017-17805)\nIt was discovered that some implementations of the Salsa20 block\n cipher did not correctly handle zero-length input. A local user\n could use this to cause a denial of service (crash) or possibly\n have other security impact.\n* [CVE-2017-17806](https://security-tracker.debian.org/tracker/CVE-2017-17806)\nIt was discovered that the HMAC implementation could be used with\n an underlying hash algorithm that requires a key, which was not\n intended. A local user could use this to cause a denial of\n service (crash or memory corruption), or possibly for privilege\n escalation.\n* [CVE-2017-17807](https://security-tracker.debian.org/tracker/CVE-2017-17807)\nEric Biggers discovered that the KEYS subsystem lacked a check for\n write permission when adding keys to a process's default keyring.\n A local user could use this to cause a denial of service or to\n obtain sensitive information.\n* [CVE-2017-17862](https://security-tracker.debian.org/tracker/CVE-2017-17862)\nAlexei Starovoitov discovered that the Extended BPF verifier\n ignored unreachable code, even though it would still be processed\n by JIT compilers. This could possibly be used by local users for\n denial of service. It also increases the severity of bugs in\n determining unreachable code.\n* [CVE-2017-17863](https://security-tracker.debian.org/tracker/CVE-2017-17863)\nJann Horn discovered that the Extended BPF verifier did not\n correctly model pointer arithmetic on the stack frame pointer.\n A local user can use this for privilege escalation.\n* [CVE-2017-17864](https://security-tracker.debian.org/tracker/CVE-2017-17864)\nJann Horn discovered that the Extended BPF verifier could fail to\n detect pointer leaks from conditional code. A local user could\n use this to obtain sensitive information in order to exploit\n other vulnerabilities.\n* [CVE-2017-1000407](https://security-tracker.debian.org/tracker/CVE-2017-1000407)\nAndrew Honig reported that the KVM implementation for Intel\n processors allowed direct access to host I/O port 0x80, which\n is not generally safe. On some systems this allows a guest\n VM to cause a denial of service (crash) of the host.\n* [CVE-2017-1000410](https://security-tracker.debian.org/tracker/CVE-2017-1000410)\nBen Seri reported that the Bluetooth subsystem did not correctly\n handle short EFS information elements in L2CAP messages. An\n attacker able to communicate over Bluetooth could use this to\n obtain sensitive information from the kernel.\n\n\nThe various problems in the Extended BPF verifier can be mitigated by\ndisabling use of Extended BPF by unprivileged users:\n`sysctl kernel.unprivileged_bpf_disabled=1`\n\n\nDebian disables unprivileged user namespaces by default, but if they\nare enabled (via the `kernel.unprivileged_userns_clone` sysctl) then\n[\\\nCVE-2017-17448](https://security-tracker.debian.org/tracker/CVE-2017-17448) can be exploited by any local user.\n\n\nFor the stable distribution (stretch), these problems have been fixed in\nversion 4.9.65-3+deb9u1.\n\n\nWe recommend that you upgrade your linux packages.\n\n\nFor the detailed security status of linux please refer to its security\ntracker page at: [\\\nhttps://security-tracker.debian.org/tracker/linux](https://security-tracker.debian.org/tracker/linux)\n\n\n",
	"affected": [
		{
			"package": {
				"ecosystem": "Debian:9",
				"name": "linux",
				"purl": "pkg:deb/debian/linux?arch=source"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "4.9.65-3+deb9u1"
						}
					]
				}
			],
			"versions": [
				"4.9.30-2",
				"4.9.30-2+deb9u1",
				"4.9.30-2+deb9u2",
				"4.9.30-2+deb9u2~bpo8+1",
				"4.9.30-2+deb9u3",
				"4.9.30-2+deb9u4",
				"4.9.30-2+deb9u5",
				"4.9.30-2+deb9u5~bpo8+1",
				"4.9.47-1",
				"4.9.51-1",
				"4.9.51-1~bpo8+1",
				"4.9.65-1",
				"4.9.65-2",
				"4.9.65-3",
				"4.9.65-3+deb9u1~bpo8+1",
				"4.9.65-3~bpo8+1"
			],
			"database_specific": {
				"source": "https://storage.googleapis.com/debian-osv/dsa-osv/DSA-4073-1.json"
			}
		}
	],
	"references": [
		{
			"type": "ADVISORY",
			"url": "https://www.debian.org/security/2017/dsa-4073"
		}
	]
}
