{
	"schema_version": "1.6.0",
	"id": "DLA-335-1",
	"modified": "2023-06-28T06:21:28.207929Z",
	"published": "2015-10-28T00:00:00Z",
	"related": [
		"CVE-2015-5146",
		"CVE-2015-5194",
		"CVE-2015-5195",
		"CVE-2015-5219",
		"CVE-2015-5300",
		"CVE-2015-7691",
		"CVE-2015-7692",
		"CVE-2015-7701",
		"CVE-2015-7702",
		"CVE-2015-7703",
		"CVE-2015-7704",
		"CVE-2015-7850",
		"CVE-2015-7851",
		"CVE-2015-7852",
		"CVE-2015-7855",
		"CVE-2015-7871"
	],
	"summary": "ntp - security update",
	"details": "\nSeveral security issues where found in ntp:\n\n\n* [CVE-2015-5146](https://security-tracker.debian.org/tracker/CVE-2015-5146)\nA flaw was found in the way ntpd processed certain remote\n configuration packets. An attacker could use a specially crafted\n package to cause ntpd to crash if:\n\n\n\t+ ntpd enabled remote configuration\n\t+ The attacker had the knowledge of the configuration password\n\t+ The attacker had access to a computer entrusted to perform remote\n\t configurationNote that remote configuration is disabled by default in NTP.\n* [CVE-2015-5194](https://security-tracker.debian.org/tracker/CVE-2015-5194)\nIt was found that ntpd could crash due to an uninitialized variable\n when processing malformed logconfig configuration commands.\n* [CVE-2015-5195](https://security-tracker.debian.org/tracker/CVE-2015-5195)\nIt was found that ntpd exits with a segmentation fault when a\n statistics type that was not enabled during compilation (e.g.\n timingstats) is referenced by the statistics or filegen\n configuration command\n* [CVE-2015-5219](https://security-tracker.debian.org/tracker/CVE-2015-5219)\nIt was discovered that sntp program would hang in an infinite loop when\n a crafted NTP packet was received, related to the conversion of the\n precision value in the packet to double.\n* [CVE-2015-5300](https://security-tracker.debian.org/tracker/CVE-2015-5300)\nIt was found that ntpd did not correctly implement the -g option:\n\n\nNormally, ntpd exits with a message to the system log if the offset\n exceeds the panic threshold, which is 1000 s by default. This\n option allows the time to be set to any value without restriction;\n however, this can happen only once. If the threshold is exceeded\n after that, ntpd will exit with a message to the system log. This\n option can be used with the -q and -x options.\n\n\nntpd could actually step the clock multiple times by more than the\n panic threshold if its clock discipline doesn't have enough time to\n reach the sync state and stay there for at least one update. If a\n man-in-the-middle attacker can control the NTP traffic since ntpd\n was started (or maybe up to 15-30 minutes after that), they can\n prevent the client from reaching the sync state and force it to step\n its clock by any amount any number of times, which can be used by\n attackers to expire certificates, etc.\n\n\nThis is contrary to what the documentation says. Normally, the\n assumption is that an MITM attacker can step the clock more than the\n panic threshold only once when ntpd starts and to make a larger\n adjustment the attacker has to divide it into multiple smaller\n steps, each taking 15 minutes, which is slow.\n* [CVE-2015-7691](https://security-tracker.debian.org/tracker/CVE-2015-7691), [CVE-2015-7692](https://security-tracker.debian.org/tracker/CVE-2015-7692), [CVE-2015-7702](https://security-tracker.debian.org/tracker/CVE-2015-7702)\nIt was found that the fix for [CVE-2014-9750](https://security-tracker.debian.org/tracker/CVE-2014-9750) was incomplete: three\n issues were found in the value length checks in ntp\\_crypto.c, where\n a packet with particular autokey operations that contained malicious\n data was not always being completely validated. Receipt of these\n packets can cause ntpd to crash.\n* [CVE-2015-7701](https://security-tracker.debian.org/tracker/CVE-2015-7701)\nA memory leak flaw was found in ntpd's CRYPTO\\_ASSOC. If ntpd is\n configured to use autokey authentication, an attacker could send\n packets to ntpd that would, after several days of ongoing attack,\n cause it to run out of memory.\n* [CVE-2015-7703](https://security-tracker.debian.org/tracker/CVE-2015-7703)\nMiroslav LichvĂĄr of Red Hat found that the :config command can be\n used to set the pidfile and driftfile paths without any\n restrictions. A remote attacker could use this flaw to overwrite a\n file on the file system with a file containing the pid of the ntpd\n process (immediately) or the current estimated drift of the system\n clock (in hourly intervals). For example:\n\n\n\n```\n\n    ntpq -c ':config pidfile /tmp/ntp.pid'\n    ntpq -c ':config driftfile /tmp/ntp.drift'\n\n```\n\nIn Debian ntpd is configured to drop root privileges, which limits\n the impact of this issue.\n* [CVE-2015-7704](https://security-tracker.debian.org/tracker/CVE-2015-7704)\nWhen ntpd as an NTP client receives a Kiss-of-Death (KoD) packet\n from the server to reduce its polling rate, it doesn't check if the\n originate timestamp in the reply matches the transmit timestamp from\n its request. An off-path attacker can send a crafted KoD packet to\n the client, which will increase the client's polling interval to a\n large value and effectively disable synchronization with the server.\n* [CVE-2015-7850](https://security-tracker.debian.org/tracker/CVE-2015-7850)\nAn exploitable denial of service vulnerability exists in the remote\n configuration functionality of the Network Time Protocol. A\n specially crafted configuration file could cause an endless loop\n resulting in a denial of service. An attacker could provide a the\n malicious configuration file to trigger this vulnerability.\n* [CVE-2015-7851](https://security-tracker.debian.org/tracker/CVE-2015-7851)\nA potential path traversal vulnerability exists in the config file\n saving of ntpd on VMS. A specially crafted path could cause a path\n traversal potentially resulting in files being overwritten. An\n attacker could provide a malicious path to trigger this\n vulnerability.\n\n\nThis issue does not affect Debian.\n* [CVE-2015-7852](https://security-tracker.debian.org/tracker/CVE-2015-7852)\nA potential off by one vulnerability exists in the cookedprint\n functionality of ntpq. A specially crafted buffer could cause a\n buffer overflow potentially resulting in null byte being written out\n of bounds.\n* [CVE-2015-7855](https://security-tracker.debian.org/tracker/CVE-2015-7855)\nIt was found that NTP's decodenetnum() would abort with an assertion\n failure when processing a mode 6 or mode 7 packet containing an\n unusually long data value where a network address was expected. This\n could allow an authenticated attacker to crash ntpd.\n* [CVE-2015-7871](https://security-tracker.debian.org/tracker/CVE-2015-7871)\nAn error handling logic error exists within ntpd that manifests due\n to improper error condition handling associated with certain\n crypto-NAK packets. An unauthenticated, off-path attacker can force\n ntpd processes on targeted servers to peer with time sources of the\n attacker's choosing by transmitting symmetric active crypto-NAK\n packets to ntpd. This attack bypasses the authentication typically\n required to establish a peer association and allows an attacker to\n make arbitrary changes to system time.\n\n\n",
	"affected": [
		{
			"package": {
				"ecosystem": "Debian:6.0",
				"name": "ntp",
				"purl": "pkg:deb/debian/ntp?arch=source"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "1:4.2.6.p2+dfsg-1+deb6u4"
						}
					]
				}
			],
			"versions": [
				"1:4.2.6.p2+dfsg-1"
			],
			"database_specific": {
				"source": "https://storage.googleapis.com/debian-osv/dla-osv/DLA-335-1.json"
			}
		}
	],
	"references": [
		{
			"type": "ADVISORY",
			"url": "https://www.debian.org/lts/security/2015/dla-335"
		}
	]
}
